{
    "technology": {
    "title": "Technology Evolution",
    "description": "Explore major milestones in technological development",
    "subtopics": {
      "computers": {
        "title": "Computer Evolution",
        "description": "A deep dive into the history of computing devices, from early mechanical machines to modern quantum computing concepts.",
        "events": [
          {
            "date": "1946",
            "title": "ENIAC Invented",
            "description": "The Electronic Numerical Integrator and Computer (ENIAC) was the first general-purpose, electronic, digital computer. Built at the University of Pennsylvania, it was a massive machine, weighing 30 tons and occupying 1,800 square feet. It was initially designed to calculate artillery firing tables for the U.S. Army, but its architecture laid the foundation for all modern computers, demonstrating that a machine could be programmed to perform a wide variety of tasks by changing its wiring.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/6/6c/ENIAC_Penn1.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/ENIAC"
          },
          {
            "date": "1958",
            "title": "The Integrated Circuit",
            "description": "Jack Kilby of Texas Instruments invented the integrated circuit, a device that combined multiple transistors onto a single silicon chip. This invention was a monumental leap forward, allowing for the miniaturization and mass production of electronic devices. It paved the way for the development of microprocessors and personal computers, ultimately leading to the technological revolution we know today. The Nobel Prize in Physics was awarded to Kilby in 2000 for this work.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/First_integrated_circuit.jpg/1280px-First_integrated_circuit.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Integrated_circuit"
          },
          {
            "date": "1971",
            "title": "First Microprocessor",
            "description": "Intel introduced the 4004, the first commercially available microprocessor. This single chip contained all the essential components of a computer's central processing unit (CPU). It was initially designed for a business calculator but quickly found applications in various electronic devices. The 4004 marked a turning point, making it possible to create smaller, more powerful, and more affordable computers, leading to the eventual emergence of the personal computer era.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Intel_4004_in_pin_4.jpg/1280px-Intel_4004_in_pin_4.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Intel_4004"
          },
          {
            "date": "1981",
            "title": "IBM PC Introduced",
            "description": "The IBM 5150, or the IBM Personal Computer, became the standard for personal computing. It was a significant product because of IBM's reputation, which lent credibility to the nascent personal computer market. It used an Intel 8088 processor and Microsoft's MS-DOS operating system. Its open architecture allowed other companies to produce compatible hardware and software, leading to a massive ecosystem of 'IBM clones' and establishing the PC as a dominant force in the industry.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/3/37/IBM_PC_5150.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/IBM_Personal_Computer"
          },
          {
            "date": "1984",
            "title": "Apple Macintosh Launch",
            "description": "Apple introduced the Macintosh, a personal computer with a graphical user interface (GUI) and a mouse. This was a radical departure from the text-based interfaces of the time. The iconic Super Bowl commercial directed by Ridley Scott famously introduced the computer to the world. Although not the first computer with a GUI, its design and marketing made it a commercial success, popularizing the concept of user-friendly computing and inspiring future operating systems.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Macintosh_128k_transparency.png/1280px-Macintosh_128k_transparency.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Macintosh"
          },
          {
            "date": "1993",
            "title": "Pentium Processor Released",
            "description": "Intel released the fifth generation of its x86 architecture, the Pentium processor. This processor featured a new superscalar design, allowing it to execute multiple instructions per clock cycle. This led to a significant increase in computing power and enabled more complex software, including early 3D graphics and multimedia applications. The Pentium became a household name, synonymous with high-performance personal computing for the next decade.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/6/60/Intel_Pentium_P5.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Pentium"
          },
          {
            "date": "2007",
            "title": "iPhone Released",
            "description": "Apple's iPhone revolutionized mobile computing. It was not just a phone, but a combination of a phone, an iPod, and an internet communicator with a multi-touch interface. It introduced the concept of the App Store, creating an ecosystem of third-party applications that transformed how people use mobile devices. The iPhone's success set the standard for modern smartphones and heavily influenced the design and functionality of competitors.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/3/32/IPhone_1st_Gen.svg",
            "searchUrl": "https://en.wikipedia.org/wiki/IPhone_(1st_generation)"
          },
          {
            "date": "2016",
            "title": "Tesla Autopilot Released",
            "description": "Tesla's Autopilot marked a major deployment of advanced driver-assistance systems. It utilized a combination of cameras, radar, and ultrasonic sensors, along with advanced AI and sensor fusion technology, to enable the car to steer, accelerate, and brake automatically within its lane. While not fully autonomous, it was a major step toward self-driving cars, raising public awareness and pushing the automotive industry to invest heavily in autonomous technology.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Tesla_Model_S_Autopilot.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Tesla_Autopilot"
          }
        ]
      },
      "internet": {
        "title": "Internet History",
        "description": "A timeline charting the development of the global network, from its military origins to the social media age.",
        "events": [
          {
            "date": "1969",
            "title": "ARPANET Established",
            "description": "The Advanced Research Projects Agency Network (ARPANET) was the precursor to the modern internet. It was a computer network developed by the U.S. Department of Defense to allow researchers to share information and resources. The first message was sent on October 29, 1969, from UCLA to the Stanford Research Institute. This event proved that computers could communicate over a vast network, laying the groundwork for the future global internet.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/6/60/Arpanet_1974.svg",
            "searchUrl": "https://en.wikipedia.org/wiki/ARPANET"
          },
          {
            "date": "1983",
            "title": "TCP/IP Protocol",
            "description": "On January 1, 1983, ARPANET officially switched to using the Transmission Control Protocol/Internet Protocol (TCP/IP). This standardized set of rules became the universal language for data communication across different networks. This change made it possible for different computer networks to connect and communicate with each other, a concept known as 'internetworking.' This is considered the birth of the internet as we know it today.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Tcp-ip-stack.svg/1280px-Tcp-ip-stack.svg.png",
            "searchUrl": "https://en.wikipedia.org/wiki/TCP/IP"
          },
          {
            "date": "1991",
            "title": "World Wide Web Launched",
            "description": "Tim Berners-Lee, a scientist at CERN, invented the World Wide Web. He created HTML, the first web browser, and the first web server, making it possible for people to access and share information through hyperlinks. The first website, info.cern.ch, was launched, providing a simple interface for sharing scientific information. This invention transformed the internet from a niche network for researchers into a global medium for information and commerce.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/d/d1/First_Web_Server.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/World_Wide_Web"
          },
          {
            "date": "1993",
            "title": "Mosaic Web Browser",
            "description": "The Mosaic web browser, developed at the National Center for Supercomputing Applications (NCSA), was the first browser to display images inline with text, rather than in separate windows. This graphical interface made the web visually appealing and easy to navigate for non-technical users. Its release sparked a boom in internet usage, leading to the commercialization of the web and the first 'dot-com' era.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Mosaic.png/1280px-Mosaic.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Mosaic_(web_browser)"
          },
          {
            "date": "1998",
            "title": "Google Founded",
            "description": "Larry Page and Sergey Brin founded Google while they were PhD students at Stanford University. Their innovative search engine, based on the PageRank algorithm, provided more relevant search results than its competitors by ranking pages based on the number and quality of links pointing to them. Google's success revolutionized web search and became a cornerstone of the internet, leading to a massive company that now provides a wide range of services.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Google_2015_logo.svg",
            "searchUrl": "https://en.wikipedia.org/wiki/Google"
          },
          {
            "date": "2001",
            "title": "Wikipedia Launched",
            "description": "Wikipedia, a free, collaborative, and multilingual encyclopedia, was launched by Jimmy Wales and Larry Sanger. It operates on a wiki model, allowing anyone to edit and contribute content. Despite initial skepticism, it has grown into one of the largest and most-used reference websites in the world, demonstrating the power of crowdsourcing and open-source collaboration on a massive scale.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Wikipedia_logo_silver.svg/1280px-Wikipedia_logo_silver.svg.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Wikipedia"
          },
          {
            "date": "2004",
            "title": "Facebook Launched",
            "description": "Mark Zuckerberg launched TheFacebook at Harvard University. It was initially a social network for college students but quickly expanded to a global audience. It allowed users to create profiles, connect with friends, and share content. Facebook's rapid growth and popularization of social networking reshaped online communication, leading to the rise of social media as a dominant force in modern life, influencing everything from politics to advertising.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Facebook_New_Logo_%282015%29.svg",
            "searchUrl": "https://en.wikipedia.org/wiki/Facebook"
          },
          {
            "date": "2007",
            "title": "Netflix Streaming Service",
            "description": "After a decade of operating as a DVD-by-mail service, Netflix launched its streaming service, fundamentally changing how people consume media. By offering an on-demand library of movies and TV shows for a monthly fee, it challenged traditional cable television and video rental stores. This move pioneered the modern streaming era, prompting a wave of similar services and altering the entertainment industry permanently.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/0/09/Netflix_2015_logo.svg",
            "searchUrl": "https://en.wikipedia.org/wiki/Netflix"
          }
        ]
      },
      "ai": {
        "title": "Artificial Intelligence",
        "description": "From Turing's test to modern deep learning breakthroughs.",
        "events": [
          {
            "date": "1950",
            "title": "Turing Test Proposed",
            "description": "Alan Turing publishes 'Computing Machinery and Intelligence,' proposing the Turing Test as a measure of machine intelligence. The test evaluates a machine's ability to exhibit intelligent behavior indistinguishable from a human. This seminal paper laid the philosophical foundation for AI research and sparked debates about machine consciousness that continue today. Turing's work remains central to discussions about what constitutes true artificial intelligence.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Alan_Turing_Aged_16.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Turing_test"
          },
          {
            "date": "1956",
            "title": "Dartmouth Workshop",
            "description": "The Dartmouth Summer Research Project on Artificial Intelligence, organized by John McCarthy, Marvin Minsky, Nathaniel Rochester, and Claude Shannon, formally established AI as a field. Over an eight-week period, researchers explored problems like natural language processing and neural networks. Although the workshop fell short of its ambitious goals, it coined the term 'artificial intelligence' and set the agenda for decades of research.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Dartmouth_College_campus_2007-09-22_12.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Dartmouth_workshop"
          },
          {
            "date": "1997",
            "title": "Deep Blue Defeats Kasparov",
            "description": "IBM's Deep Blue became the first computer system to defeat a reigning world chess champion (Garry Kasparov) under standard tournament time controls. The match lasted six games, with Deep Blue winning 3.5–2.5. This victory demonstrated that computers could outperform humans in complex intellectual tasks through brute-force computation and specialized algorithms, though it lacked true 'understanding' of the game.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Kasparov-29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Deep_Blue_(chess_computer)"
          },
          {
            "date": "2011",
            "title": "IBM Watson Wins Jeopardy!",
            "description": "IBM's Watson defeated Jeopardy! champions Ken Jennings and Brad Rutter in a two-game match, showcasing advanced natural language processing capabilities. Watson could parse complex questions, search its 200 million pages of structured and unstructured content, and deliver precise answers in seconds. This demonstrated AI's potential to understand and process human language at scale, with applications in healthcare, finance, and customer service.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/9/93/IBM_Watson_at_Jeopardy.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Watson_(computer)"
          },
          {
            "date": "2016",
            "title": "AlphaGo Defeats Lee Sedol",
            "description": "Google DeepMind's AlphaGo defeated 18-time world Go champion Lee Sedol 4–1 in a five-game match. Go, with its 10^170 possible board configurations, was considered a 'grand challenge' for AI due to its complexity. AlphaGo combined deep neural networks with Monte Carlo tree search, demonstrating that AI could master intuitive, creative tasks previously thought to be uniquely human. This marked a paradigm shift in AI capabilities.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/5/55/Google_DeepMind_Logo_2015.png",
            "searchUrl": "https://en.wikipedia.org/wiki/AlphaGo"
          },
          {
            "date": "2020",
            "title": "GPT-3 Released",
            "description": "OpenAI released GPT-3 (Generative Pre-trained Transformer 3), a language model with 175 billion parameters. It could generate human-like text, translate languages, write code, and answer questions with remarkable coherence. While prone to factual errors and biases, GPT-3 demonstrated unprecedented fluency in language tasks, sparking debates about AI's creative potential and ethical implications. It became the foundation for future AI assistants and creative tools.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/4/4d/OpenAI_Logo.svg",
            "searchUrl": "https://en.wikipedia.org/wiki/GPT-3"
          },
          {
            "date": "2022",
            "title": "DALL-E 2 Creates Art",
            "description": "OpenAI's DALL-E 2 generated photorealistic images from text prompts, revolutionizing AI's role in creative fields. It could combine concepts, attributes, and styles in novel ways (e.g., 'a teddy bear swimming in the ocean as a Renaissance painting'). The model raised questions about copyright, artistic originality, and the future of human creativity. Industries from advertising to entertainment began exploring AI-generated visuals for practical applications.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/3/3a/DALL%C2%B7E_2_Example.png",
            "searchUrl": "https://en.wikipedia.org/wiki/DALL-E"
          },
          {
            "date": "2023",
            "title": "ChatGPT Goes Mainstream",
            "description": "ChatGPT reached 100 million users within two months of launch, making AI conversation accessible to the public. Based on GPT-3.5 and later GPT-4, it could draft emails, debug code, and hold nuanced discussions. Its viral adoption forced businesses, educators, and policymakers to grapple with AI's societal impact—from job displacement to misinformation. The tool became a catalyst for global discussions about AI regulation and ethical deployment.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/0/04/ChatGPT_logo.svg",
            "searchUrl": "https://en.wikipedia.org/wiki/ChatGPT"
          }
        ]
      },
      "robotics": {
        "title": "Robotics Revolution",
        "description": "From industrial arms to humanoid assistants.",
        "events": [
          {
            "date": "1961",
            "title": "Unimate Joins GM Assembly Line",
            "description": "The Unimate, developed by George Devol and Joseph Engelberger, became the first industrial robot installed at a General Motors plant in New Jersey. It performed die-casting and spot welding tasks with precision and consistency, revolutionizing manufacturing. This marked the beginning of robotics in industry, paving the way for automated production lines that would transform global manufacturing efficiency and workforce dynamics.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Unimate_Industrial_Robot.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Unimate"
          },
          {
            "date": "1997",
            "title": "Sojourner Rover on Mars",
            "description": "NASA's Mars Pathfinder mission deployed Sojourner, the first successful rover on another planet. The 11.5 kg (25 lb) robot analyzed Martian soil and rocks, transmitting data for 83 days. Its success proved that mobile robots could explore extraterrestrial terrain, setting the stage for future rovers like Spirit, Opportunity, and Curiosity. The mission captured public imagination and advanced planetary robotics.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Mars_Pathfinder_Lander.jpg/1280px-Mars_Pathfinder_Lander.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Mars_Pathfinder"
          },
          {
            "date": "2000",
            "title": "ASIMO Unveiled by Honda",
            "description": "Honda's Advanced Step in Innovative Mobility (ASIMO) became the world's most advanced humanoid robot, capable of walking, running, and climbing stairs with human-like motion. Standing 1.3 meters tall, ASIMO demonstrated breakthroughs in dynamic balance and real-time adaptability. While never commercialized, it inspired research into assistive robotics and showed the potential for robots to operate in human environments.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Honda_ASIMO_%28cropped%29.jpg/1280px-Honda_ASIMO_%28cropped%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/ASIMO"
          },
          {
            "date": "2011",
            "title": "Surgical Robot Operates Remotely",
            "description": "The da Vinci Surgical System performed its millionth procedure, demonstrating the viability of robot-assisted minimally invasive surgery. Surgeons control the system's robotic arms via a console, enabling precision beyond human hand steadiness. The technology reduced patient recovery times and complications for procedures like prostatectomies. It sparked debates about cost, training, and the future role of autonomy in medical robotics.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Da_Vinci_Surgical_System_at_work.jpg/1280px-Da_Vinci_Surgical_System_at_work.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Da_Vinci_Surgical_System"
          },
          {
            "date": "2013",
            "title": "Boston Dynamics' Atlas Revealed",
            "description": "Boston Dynamics unveiled Atlas, a humanoid robot capable of dynamic walking, running, and parkour. Funded by DARPA, Atlas demonstrated unprecedented agility through advanced control algorithms and hydraulic actuators. Videos of the robot recovering from pushes or performing backflips went viral, showcasing progress toward robots that could operate in disaster zones or military scenarios. Its development raised ethical questions about lethal autonomous weapons.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Atlas_from_Boston_Dynamics.jpg/1280px-Atlas_from_Boston_Dynamics.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Atlas_(robot)"
          },
          {
            "date": "2016",
            "title": "Sophia Granted Citizenship",
            "description": "Saudi Arabia granted citizenship to Sophia, a humanoid robot developed by Hanson Robotics. Equipped with facial recognition and natural language processing, Sophia could simulate human-like conversations. While primarily a PR stunt, the event sparked global discussions about robot rights, legal personhood, and the blurred line between AI simulation and consciousness. Critics argued it anthropomorphized narrow AI capabilities.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Sophia_%28robot%29.jpg/1280px-Sophia_%28robot%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Sophia_(robot)"
          },
          {
            "date": "2020",
            "title": "Robotaxis Operate in China",
            "description": "Baidu Apollo and AutoX launched fully driverless robotaxi services in Shenzhen and Beijing, marking a milestone in autonomous vehicle deployment. These vehicles navigated complex urban environments without safety drivers, relying on lidar, cameras, and AI. The services operated in limited geofenced areas but demonstrated progress toward scalable self-driving technology. Regulatory frameworks struggled to keep pace with the rapid advancements.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Baidu_Apollo_Logo.svg/1280px-Baidu_Apollo_Logo.svg.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Baidu_Apollo"
          },
          {
            "date": "2023",
            "title": "Tesla Optimus Demo",
            "description": "Tesla showcased Optimus, a bipedal general-purpose robot designed for mass production. Elon Musk claimed it would eventually perform household chores and manual labor at a cost lower than human workers. While early prototypes were rudimentary compared to Boston Dynamics' robots, Tesla's approach leveraged automotive manufacturing techniques. The project highlighted ambitions to commoditize humanoid robots, though experts questioned its near-term feasibility.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Tesla_Optimus_robot_2022.png/1280px-Tesla_Optimus_robot_2022.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Tesla_Optimus"
          }
        ]
      },
      "telecommunications": {
        "title": "Telecommunications",
        "description": "From telegraphs to 5G networks.",
        "events": [
          {
            "date": "1844",
            "title": "First Telegraph Message",
            "description": "Samuel Morse sent the first official telegraph message ('What hath God wrought') from Washington, D.C., to Baltimore, inaugurating the electric telegraph era. The Morse code system encoded letters as sequences of dots and dashes, enabling rapid long-distance communication. By 1861, telegraph lines spanned the continental U.S., and by 1866, transatlantic cables connected Europe and America. This revolutionized news dissemination, business, and diplomacy.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Samuel_Morse_1840.jpg/1280px-Samuel_Morse_1840.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Electrical_telegraph"
          },
          {
            "date": "1876",
            "title": "Bell Patents the Telephone",
            "description": "Alexander Graham Bell patented the telephone (U.S. Patent 174,465), transmitting speech electrically over wires. His famous first call to assistant Thomas Watson ('Mr. Watson, come here, I want to see you') demonstrated real-time voice communication. The Bell Telephone Company (later AT&T) commercialized the invention, though Elisha Gray filed a similar patent hours later, sparking legal battles. By 1900, over 600,000 phones were in use worldwide.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Alexander_Graham_Bell.jpg/1280px-Alexander_Graham_Bell.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Telephone"
          },
          {
            "date": "1901",
            "title": "First Transatlantic Radio Signal",
            "description": "Guglielmo Marconi received the first transatlantic radio signal (the letter 'S' in Morse code) in Newfoundland, transmitted from Cornwall, England. This proved that radio waves could follow the Earth's curvature, enabling global wireless communication. Marconi's work laid the foundation for broadcast radio, maritime communication, and later technologies like Wi-Fi and cellular networks. He shared the 1909 Nobel Prize in Physics for this achievement.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Marconi_1901_with_apparatus.jpg/1280px-Marconi_1901_with_apparatus.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Guglielmo_Marconi"
          },
          {
            "date": "1947",
            "title": "Mobile Phone Concept Born",
            "description": "Bell Labs engineers proposed the concept of cellular telephony, dividing service areas into small 'cells' to allow frequency reuse and support many users. However, technology limitations delayed practical implementation until the 1980s. This breakthrough enabled the shift from car phones to handheld mobile devices. The first cellular networks used analog signals (1G), later evolving to digital (2G) with text messaging capabilities.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Bell_System_logo%2C_1969.svg/1280px-Bell_System_logo%2C_1969.svg.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Cellular_network"
          },
          {
            "date": "1983",
            "title": "First Commercial Cell Phone",
            "description": "Motorola's DynaTAC 8000X became the first commercially available handheld cellular phone. Weighing 1.1 kg (2.4 lb) with 30 minutes of talk time, it cost $3,995 ($12,000 today). Despite its limitations, it marked the beginning of the mobile revolution. The Advanced Mobile Phone System (AMPS) analog network in Chicago served as its backbone. Within a decade, smaller, more affordable models would make mobile phones a consumer staple.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Motorola_DynaTAC_8000X.jpg/1280px-Motorola_DynaTAC_8000X.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Motorola_DynaTAC"
          },
          {
            "date": "1998",
            "title": "3G Standards Finalized",
            "description": "The International Telecommunication Union (ITU) approved the IMT-2000 specifications for 3G networks, enabling mobile internet access at speeds up to 2 Mbps. This allowed video calls, mobile TV, and GPS navigation. Japan's NTT Docomo launched the first commercial 3G service in 2001. The shift from circuit-switched (voice-centric) to packet-switched (data-centric) networks paved the way for smartphones and app ecosystems.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/International_Telecommunication_Union_logo.svg/1280px-International_Telecommunication_Union_logo.svg.png",
            "searchUrl": "https://en.wikipedia.org/wiki/3G"
          },
          {
            "date": "2007",
            "title": "iPhone Redefines Mobile",
            "description": "Apple's iPhone combined a phone, iPod, and internet communicator with a multi-touch interface, setting the standard for modern smartphones. Its App Store (launched 2008) created an ecosystem for third-party applications. The iPhone accelerated the transition from feature phones to always-connected smart devices, making mobile the primary computing platform for billions. Competitors rapidly adopted touchscreens and app stores.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/3/32/IPhone_1st_Gen.svg",
            "searchUrl": "https://en.wikipedia.org/wiki/IPhone_(1st_generation)"
          },
          {
            "date": "2019",
            "title": "5G Rollout Begins",
            "description": "South Korea launched the first nationwide 5G networks, offering speeds up to 100× faster than 4G with ultra-low latency. 5G's millimeter-wave spectrum enabled innovations like autonomous vehicles, remote surgery, and augmented reality. However, deployment faced challenges including infrastructure costs, limited range, and health concerns (later debunked). By 2023, over 1 billion 5G subscriptions existed globally.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Samsung_Galaxy_S10_5G.jpg/1280px-Samsung_Galaxy_S10_5G.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/5G"
          }
        ]
      }
    }
  },
  "science": {
    "title": "Scientific Breakthroughs",
    "description": "Key discoveries that changed our understanding of the world",
    "subtopics": {
      "physics": {
        "title": "Physics Milestones",
        "description": "From Newton's laws to quantum mysteries.",
        "events": [
          {
            "date": "1687",
            "title": "Newton's Principia Published",
            "description": "Isaac Newton's 'Philosophiæ Naturalis Principia Mathematica' formulated the laws of motion and universal gravitation. This foundational work established classical mechanics, explaining everything from falling apples to planetary orbits. Newton's calculus (developed concurrently but published later) provided the mathematical framework. The Principia's three laws became the cornerstone of physics for over two centuries until Einstein's relativity expanded them.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/3/39/Principia-title.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Philosophi%C3%A6_Naturalis_Principia_Mathematica"
          },
          {
            "date": "1905",
            "title": "Einstein's Annus Mirabilis",
            "description": "Albert Einstein published four groundbreaking papers in 1905: on the photoelectric effect (laying quantum theory foundations), Brownian motion (confirming atoms' existence), special relativity (introducing E=mc²), and mass-energy equivalence. These works revolutionized physics by challenging Newtonian absolutes of space/time and introducing quantum ideas. The photoelectric effect paper earned him the 1921 Nobel Prize, though relativity wasn't yet fully recognized.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Einstein_1921_by_F_Schmutzer_-_restoration.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Annus_mirabilis_papers"
          },
          {
            "date": "1915",
            "title": "General Relativity",
            "description": "Einstein completed his theory of general relativity, describing gravity as spacetime curvature caused by mass/energy. It predicted light bending near massive objects (confirmed during the 1919 solar eclipse) and explained Mercury's orbit anomaly. The theory underpins modern cosmology, GPS accuracy, and black hole studies. Its equations suggest an expanding universe, later observed by Hubble, and remain our best description of gravity at cosmic scales.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Einstein-with-friends-on-a-bicycle-and-in-a-boat.jpg/1280px-Einstein-with-friends-on-a-bicycle-and-in-a-boat.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/General_relativity"
          },
          {
            "date": "1927",
            "title": "Quantum Uncertainty",
            "description": "Werner Heisenberg formulated the uncertainty principle, showing that a particle's position and momentum cannot both be precisely known. This fundamental limit challenged classical determinism, revealing quantum mechanics' probabilistic nature. Niels Bohr's Copenhagen interpretation (wavefunction collapse upon measurement) and Schrödinger's wave equation (1926) further developed quantum theory, which now underpins semiconductors, lasers, and MRI machines.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Heisenberg_in_1933.jpg/1280px-Heisenberg_in_1933.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Uncertainty_principle"
          },
          {
            "date": "1964",
            "title": "Higgs Mechanism Proposed",
            "description": "Peter Higgs and others theorized the Higgs field, which gives particles mass via interactions. The associated Higgs boson became physics' 'missing piece' for decades. Its existence would validate the Standard Model, but required energies beyond 1960s accelerators. Higgs' paper was initially rejected; only after adding the boson prediction was it published. He shared the 2013 Nobel Prize after the boson's 2012 discovery at CERN.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Peter_Higgs_at_CERN_-_March_2012_%2802%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Higgs_mechanism"
          },
          {
            "date": "2012",
            "title": "Higgs Boson Discovered",
            "description": "CERN announced the discovery of a Higgs-like boson (125 GeV) using the Large Hadron Collider (LHC). The particle's properties matched predictions, completing the Standard Model. Two teams (ATLAS and CMS) independently confirmed it with 5-sigma certainty. The discovery validated 50 years of theoretical work and earned Higgs/Englert the Nobel Prize. The LHC's 27-km ring and $4.75B cost underscored modern 'big science' scale.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Higgs_boson_discovery_2.svg/1280px-Higgs_boson_discovery_2.svg.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Higgs_boson"
          },
          {
            "date": "2016",
            "title": "Gravitational Waves Detected",
            "description": "LIGO observed gravitational waves from two merging black holes (1.3B light-years away), confirming Einstein's 1916 prediction. The waves stretched spacetime by 1/1000th of a proton's width, detected via laser interferometry. This opened gravitational-wave astronomy, allowing study of cosmic events invisible to telescopes. The 2017 Nobel Prize recognized Weiss, Barish, and Thorne's decades-long instrumentation work.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/6/61/LIGO_measurement_of_gravitational_waves.svg",
            "searchUrl": "https://en.wikipedia.org/wiki/First_observation_of_gravitational_waves"
          },
          {
            "date": "2019",
            "title": "First Black Hole Image",
            "description": "The Event Horizon Telescope (a global radio telescope network) captured the supermassive black hole in M87's galaxy. The glowing ring of hot gas matched general relativity predictions for a 6.5B-solar-mass black hole. Achieving this required synchronizing atomic clocks across continents and processing petabytes of data. The image provided direct visual evidence of black holes' existence and geometry.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/M87_black_hole_in_polarised_light.jpg/1280px-M87_black_hole_in_polarised_light.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/First_image_of_a_black_hole"
          }
        ]
      },
      "biology": {
        "title": "Biology Discoveries",
        "description": "From cells to CRISPR.",
        "events": [
          {
            "date": "1665",
            "title": "Cells Discovered",
            "description": "Robert Hooke observed cork's cellular structure using a microscope, coining the term 'cell' in his book 'Micrographia.' Though he saw only dead cell walls, his work inspired the cell theory (all organisms are composed of cells). Antonie van Leeuwenhoek later described living cells (1674), including bacteria. These discoveries laid the foundation for microbiology and histology, revealing life's universal building blocks.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Micrographia-p2-cell-drawing.jpg/1280px-Micrographia-p2-cell-drawing.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Cell_(biology)"
          },
          {
            "date": "1859",
            "title": "Darwin's Origin of Species",
            "description": "Charles Darwin published 'On the Origin of Species,' proposing natural selection as evolution's mechanism. His 20-year research (including Galápagos finches) showed how traits favoring survival/reproduction become common over generations. Though controversial, the theory unified biology, explaining biodiversity without divine intervention. Mendel's contemporaneous genetics work (1866) later provided the inheritance mechanism Darwin lacked.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Origin_of_Species_title_page.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/On_the_Origin_of_Species"
          },
          {
            "date": "1953",
            "title": "DNA Structure Solved",
            "description": "James Watson and Francis Crick deduced DNA's double helix structure using Rosalind Franklin's X-ray diffraction images. Their model showed how base pairing (A-T, C-G) allows genetic replication. Franklin's Photo 51 (taken by Raymond Gosling) was critical but uncredited until later. The discovery launched molecular biology, explaining heredity and enabling genetic engineering. All three received Nobel Prizes (Franklin posthumously).",
            "image": "https://upload.wikimedia.org/wikipedia/commons/4/4c/DNA_Structure%2BKey%2BLabelled.pn_NoBB.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Double_helix"
          },
          {
            "date": "1996",
            "title": "Dolly the Cloned Sheep",
            "description": "The Roslin Institute cloned Dolly from an adult somatic cell, proving specialized cells could be reprogrammed into embryos. This challenged the dogma that cell differentiation was irreversible. Dolly's birth sparked ethical debates about human cloning and stem cell research. Though she died prematurely (2003), her legacy advanced regenerative medicine and transgenic animal research.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/7/73/Dolly_the_sheep.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Dolly_(sheep)"
          },
          {
            "date": "2003",
            "title": "Human Genome Sequenced",
            "description": "The Human Genome Project (HGP) completed sequencing all 3 billion DNA base pairs, identifying ~20,000 genes. This 13-year, $3B international effort used Sanger sequencing. The data revealed humans share 99.9% genetic identity and provided insights into disease, evolution, and personalized medicine. Private rival Celera Genomics accelerated progress via shotgun sequencing, leading to a 2000 joint announcement with the HGP.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/3/3f/DNA_sequence_viewer.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Human_Genome_Project"
          },
          {
            "date": "2012",
            "title": "CRISPR Gene Editing",
            "description": "Jennifer Doudna and Emmanuelle Charpentier adapted the bacterial CRISPR-Cas9 system into a programmable gene-editing tool. It allows precise DNA cuts at specified locations, enabling gene deletions, repairs, or insertions. Applications range from curing genetic diseases to engineering crops. Ethical concerns arose after a 2018 CRISPR baby scandal. The pair won the 2020 Nobel Prize in Chemistry.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/CRISPR_flow_diagram.png/1280px-CRISPR_flow_diagram.png",
            "searchUrl": "https://en.wikipedia.org/wiki/CRISPR_gene_editing"
          },
          {
            "date": "2020",
            "title": "mRNA COVID-19 Vaccines",
            "description": "Pfizer-BioNTech and Moderna deployed mRNA vaccines against COVID-19 within a year of the pandemic's start. Unlike traditional vaccines (using weakened viruses), mRNA vaccines instruct cells to produce viral spike proteins, triggering immunity. The technology, developed over decades, proved 95% effective and enabled rapid variant updates. This marked a turning point in vaccinology and pandemic response capabilities.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/COVID-19_vaccine_Pfizer.png/1200px-COVID-19_vaccine_Pfizer.png",
            "searchUrl": "https://en.wikipedia.org/wiki/RNA_vaccine"
          },
          {
            "date": "2023",
            "title": "Synthetic Human Embryos",
            "description": "Scientists created synthetic human embryo-like structures from stem cells, bypassing fertilization. These models (lacking hearts/brains) aim to study early development and miscarriage causes. Ethical concerns arose about potential future viability. The breakthrough demonstrated stem cells' self-organization capacity and could reduce reliance on donated embryos for research.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Blastocyst.jpg/1280px-Blastocyst.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Synthetic_embryo"
          }
        ]
      },
      "chemistry": {
        "title": "Chemistry Breakthroughs",
        "description": "From elements to nanotech.",
        "events": [
          {
            "date": "1869",
            "title": "Mendeleev's Periodic Table",
            "description": "Dmitri Mendeleev organized elements by atomic weight and properties, leaving gaps for undiscovered elements (e.g., gallium, germanium). His table predicted their properties accurately, validating its utility. Earlier attempts (e.g., Newlands' octaves) lacked predictive power. The modern table arranges elements by atomic number (protons), reflecting quantum mechanical electron configurations. It remains chemistry's foundational framework.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/DIMendeleevCab.jpg/1280px-DIMendeleevCab.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Periodic_table"
          },
          {
            "date": "1911",
            "title": "Superconductivity Discovered",
            "description": "Heike Kamerlingh Onnes observed mercury's electrical resistance vanishing at 4.2K (-269°C), the first superconductor. This quantum phenomenon enables MRI machines and maglev trains. The BCS theory (1957) explained low-T superconductivity via electron-phonon interactions. High-T superconductors (1986, e.g., YBCO at 77K) remain poorly understood but promise lossless power grids if room-T versions are found.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Heike_Kamerlingh_Onnes.jpg/1280px-Heike_Kamerlingh_Onnes.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Superconductivity"
          },
          {
            "date": "1953",
            "title": "Miller-Urey Experiment",
            "description": "Stanley Miller and Harold Urey simulated early Earth's atmosphere (water, methane, ammonia, hydrogen), sparking it with electricity to produce amino acids. This demonstrated that life's building blocks could form abiotically, supporting the primordial soup hypothesis. Though later critiques noted inaccurate atmospheric composition, the experiment inspired astrobiology and research into life's chemical origins.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Miller-Urey_experiment-en.svg/1280px-Miller-Urey_experiment-en.svg.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Miller%E2%80%93Urey_experiment"
          },
          {
            "date": "1985",
            "title": "Buckyballs Discovered",
            "description": "Harry Kroto, Richard Smalley, and Robert Curl synthesized C60 (buckminsterfullerene), a soccer-ball-shaped carbon molecule. This first fullerene revealed carbon's third allotropic form (after graphite/diamond), launching nanotechnology. Later discoveries included carbon nanotubes (1991) and graphene (2004). Applications range from drug delivery to superconductors. The trio shared the 1996 Nobel Prize in Chemistry.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Buckminsterfullerene-perspective-3D-balls.png/1280px-Buckminsterfullerene-perspective-3D-balls.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Buckminsterfullerene"
          },
          {
            "date": "1997",
            "title": "Green Chemistry Principles",
            "description": "Paul Anastas and John Warner formulated the 12 principles of green chemistry, advocating safer solvents, renewable feedstocks, and waste prevention. This framework shifted chemical industries toward sustainability, reducing toxic byproducts. Examples include enzymatic synthesis (e.g., sitagliptin diabetes drug) and CO2 as a refrigerant. The approach balances environmental and economic goals in pharmaceutical/industrial chemistry.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Paul_Anastas.jpg/1280px-Paul_Anastas.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Green_chemistry"
          },
          {
            "date": "2010",
            "title": "Artificial Photosynthesis",
            "description": "Daniel Nocera developed an efficient cobalt-phosphate catalyst for water splitting using sunlight, mimicking natural photosynthesis. This 'artificial leaf' promised renewable hydrogen fuel production. While scalability challenges remain, the work advanced solar fuel research. Other teams explored CO2 reduction to hydrocarbons, potentially closing the carbon cycle for sustainable energy storage.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Artificial_Photosynthesis.png/1280px-Artificial_Photosynthesis.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Artificial_photosynthesis"
          },
          {
            "date": "2016",
            "title": "Molecular Machines",
            "description": "Jean-Pierre Sauvage, Fraser Stoddart, and Ben Feringa won the Nobel Prize for designing nanoscale machines (rotors, elevators, muscles). These structures (1/1000th hair width) use light/chemical energy to perform mechanical tasks. Potential applications include targeted drug delivery and molecular computers. The field merges synthetic chemistry with engineering principles at the atomic scale.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Molecular_Triptych.png/1280px-Molecular_Triptych.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Molecular_machine"
          },
          {
            "date": "2022",
            "title": "Plastic-Eating Enzymes",
            "description": "Scientists engineered PETase enzymes (from plastic-eating bacteria) to break down PET plastic 30x faster than natural variants. This offers hope for addressing microplastic pollution via enzymatic recycling. Commercial systems (e.g., Carbios' biorecycling plant) aim to depolymerize waste into reusable monomers. Challenges include cost and scaling for global plastic waste volumes.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/PET_degradation_by_PETase.png/1280px-PET_degradation_by_PETase.png",
            "searchUrl": "https://en.wikipedia.org/wiki/PETase"
          }
        ]
      },
      "astronomy": {
        "title": "Astronomy Discoveries",
        "description": "From telescopes to exoplanets.",
        "events": [
          {
            "date": "1609",
            "title": "Galileo's Telescope",
            "description": "Galileo Galilei improved the refracting telescope (20x magnification) and observed Jupiter's moons, lunar craters, and Milky Way stars. His findings challenged geocentrism, supporting Copernicus' heliocentric model. The Catholic Church condemned his views (1633), but his methods established observational astronomy. Modern telescopes (e.g., Hubble, JWST) continue this legacy of cosmic discovery.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Galileo.arp.300pix.jpg/1280px-Galileo.arp.300pix.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Galileo_Galilei"
          },
          {
            "date": "1781",
            "title": "Uranus Discovered",
            "description": "William Herschel identified Uranus (first planet discovered with a telescope), initially mistaking it for a comet. Its anomalous orbit led to Neptune's 1846 prediction/discovery. Uranus' 98° axial tilt causes extreme seasons. The discovery doubled the solar system's known size and demonstrated that planets could be found beyond Saturn, reshaping cosmic perspectives.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Uranus2.jpg/1280px-Uranus2.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Uranus"
          },
          {
            "date": "1929",
            "title": "Hubble's Expanding Universe",
            "description": "Edwin Hubble correlated galaxies' redshifts with distances, proving the universe expands (Hubble's Law). This supported Lemaître's Big Bang theory over steady-state models. The Hubble constant quantifies expansion rate, critical for estimating universe age (~13.8B years). Later observations of accelerating expansion (1998) implied dark energy's existence, now a major cosmological mystery.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Edwin_Hubble_with_pipe_1928.jpg/1280px-Edwin_Hubble_with_pipe_1928.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Hubble%27s_law"
          },
          {
            "date": "1965",
            "title": "Cosmic Microwave Background",
            "description": "Arno Penzias and Robert Wilson detected the CMB (2.725K radiation), the Big Bang's afterglow. This confirmed Gamow's prediction and ruled out rival theories. COBE (1992) mapped CMB anisotropies, revealing early universe density variations that seeded galaxy formation. Precision measurements (e.g., Planck satellite) now constrain dark matter/energy parameters to <1% uncertainty.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Cmbr.svg/1280px-Cmbr.svg.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Cosmic_microwave_background"
          },
          {
            "date": "1995",
            "title": "First Exoplanet Found",
            "description": "Michel Mayor and Didier Queloz discovered 51 Pegasi b, a Jupiter-like planet orbiting a sun-like star. Using radial velocity (star wobble), they challenged assumptions about planetary systems. Over 5,000 exoplanets are now confirmed, including rocky worlds in habitable zones. JWST (2022) analyzes their atmospheres for biosignatures like oxygen/methane.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Artist%27s_impression_of_the_exoplanet_51_Pegasi_b.jpg/1280px-Artist%27s_impression_of_the_exoplanet_51_Pegasi_b.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/51_Pegasi_b"
          },
          {
            "date": "2019",
            "title": "First Black Hole Image",
            "description": "The Event Horizon Telescope collaboration released the first image of a black hole (M87*), showing a bright ring around its shadow. The 6.5B-solar-mass behemoth's appearance matched general relativity predictions. Achieving this required synchronizing telescopes globally and processing petabytes of data. The image provided direct visual proof of black holes' existence.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/M87_black_hole_in_polarised_light.jpg/1280px-M87_black_hole_in_polarised_light.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/First_image_of_a_black_hole"
          },
          {
            "date": "2022",
            "title": "JWST First Images",
            "description": "NASA's James Webb Space Telescope (launched 2021) released unprecedented infrared images of galaxy clusters, nebulae, and exoplanet atmospheres. Its 6.5m segmented mirror and cryogenic instruments peer through dust to study early universe formation. Early discoveries include candidate galaxies at z≈13 (300M years post-Big Bang), challenging galaxy evolution models.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Webb%27s_First_Deep_Field_%28NIRCam_Image%29_%28cropped%29.jpg/1280px-Webb%27s_First_Deep_Field_%28NIRCam_Image%29_%28cropped%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/James_Webb_Space_Telescope"
          },
          {
            "date": "2023",
            "title": "Oumuamua's Interstellar Origin",
            "description": "Astronomers confirmed 'Oumuamua (discovered 2017) as the first known interstellar object passing through our solar system. Its elongated shape and non-gravitational acceleration sparked debates (comet vs. alien probe). Later studies suggested a nitrogen iceberg from an exoplanet. The discovery prompted plans for intercepting future interstellar objects (e.g., ESA's Comet Interceptor).",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Oumuamua_artist%27s_impression_2017.png/1280px-Oumuamua_artist%27s_impression_2017.png",
            "searchUrl": "https://en.wikipedia.org/wiki/%CA%BBOumuamua"
          }
        ]
      },
      "neuroscience": {
        "title": "Neuroscience Milestones",
        "description": "From neurons to consciousness.",
        "events": [
          {
            "date": "1873",
            "title": "Neuron Doctrine",
            "description": "Camillo Golgi developed silver staining to visualize individual neurons, while Santiago Ramón y Cajal proposed neurons as discrete cells (not a continuous network). Their shared 1906 Nobel Prize honored this neuron doctrine, foundational for understanding brain circuitry. Electron microscopy later confirmed synapses between neurons, validating Cajal's insights.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/CajalHippocampusPyramidalCell.png/1280px-CajalHippocampusPyramidalCell.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Neuron_doctrine"
          },
          {
            "date": "1929",
            "title": "EEG Invented",
            "description": "Hans Berger recorded the first human electroencephalogram (EEG), detecting brainwave patterns. Alpha waves (8-12Hz) during relaxation became the first identified neural oscillation. EEG enabled epilepsy diagnosis and sleep stage studies. Modern high-density EEG localizes activity to millimeter precision, aiding cognitive neuroscience and brain-computer interfaces.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Hans_Berger_photo.jpg/1280px-Hans_Berger_photo.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Electroencephalography"
          },
          {
            "date": "1952",
            "title": "Hodgkin-Huxley Model",
            "description": "Alan Hodgkin and Andrew Huxley described action potentials mathematically using squid giant axons. Their model (ion channels, membrane capacitance) explained nerve impulse propagation and earned a 1963 Nobel Prize. It remains neuroscience's quantitative gold standard, foundational for computational neuroscience and drug development (e.g., sodium channel blockers).",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Hodgkin_Huxley.jpg/1280px-Hodgkin_Huxley.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Hodgkin%E2%80%93Huxley_model"
          },
          {
            "date": "1991",
            "title": "fMRI Developed",
            "description": "Seiji Ogawa demonstrated functional MRI (fMRI) by mapping brain activity via blood-oxygen-level-dependent (BOLD) signals. This noninvasive technique revolutionized cognitive neuroscience, localizing functions like language (Broca's area) and memory (hippocampus). Limitations include indirect neural measures (vascular, not electrical) and 1-2s temporal resolution vs. EEG's milliseconds.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/FMRI_of_the_brain.jpg/1280px-FMRI_of_the_brain.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Functional_magnetic_resonance_imaging"
          },
          {
            "date": "2012",
            "title": "Optogenetics Breakthrough",
            "description": "Karl Deisseroth and Ed Boyden pioneered optogenetics, using light-sensitive algal proteins (e.g., channelrhodopsin) to control neurons genetically modified to express them. This 'remote control' of neural circuits clarified Parkinson's, depression, and addiction mechanisms in animal models. Clinical trials explore optogenetic vision restoration and epilepsy treatment.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Optogenetics_Illustration.jpg/1280px-Optogenetics_Illustration.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Optogenetics"
          },
          {
            "date": "2014",
            "title": "Brain Initiative Launched",
            "description": "The U.S. BRAIN Initiative (Brain Research Through Advancing Innovative Neurotechnologies) launched with $5B funding to map neural circuits at single-cell resolution. Projects include dense electrode arrays (Neuropixels) and molecular census tools. Similar EU/Human Brain Project efforts aim for whole-brain simulations, though critics cite excessive focus on technology over theory.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/BRAIN_Initiative_Logo.png/1280px-BRAIN_Initiative_Logo.png",
            "searchUrl": "https://en.wikipedia.org/wiki/BRAIN_Initiative"
          },
          {
            "date": "2020",
            "title": "AI Predicts Protein Folding",
            "description": "DeepMind's AlphaFold2 achieved atomic-level accuracy in predicting protein 3D structures from amino acid sequences, solving a 50-year biology grand challenge. This transformed neuroscience by modeling synaptic proteins (e.g., ion channels, receptors) critical for brain function. Applications range from drug design (e.g., Alzheimer's targets) to understanding prion misfolding diseases.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Google_DeepMind_Logo_2015.png/1280px-Google_DeepMind_Logo_2015.png",
            "searchUrl": "https://en.wikipedia.org/wiki/AlphaFold"
          },
          {
            "date": "2023",
            "title": "Neuralink Human Trials",
            "description": "Elon Musk's Neuralink received FDA approval for human trials of its brain-computer interface (BCI) implant. The coin-sized device records/spikes neurons via 1,024 electrodes, aiming to treat paralysis and blindness. Early results (2024) enabled a quadriplegic to control a computer cursor. Ethical concerns include privacy, hacking risks, and animal testing controversies during development.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Neuralink_Logo.png/1280px-Neuralink_Logo.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Neuralink"
          }
        ]
      }
    }
  },
    "art": {
    "title": "Art History Timeline",
    "description": "Defining movements and masterpieces from Renaissance to Digital Age",
    "subtopics": {
      "renaissance": {
        "title": "Renaissance",
        "description": "15th-16th century revival of classical art and humanism",
        "events": [
          {
            "date": "1501-1504",
            "title": "Michelangelo's David",
            "description": "Carved from a single block of discarded Carrara marble, this 17-foot masterpiece redefined Renaissance sculpture. Michelangelo depicted David pre-battle with intense focus, using contrapposto stance and exaggerated right hand for optical correction. Originally placed in Florence's Piazza della Signoria as a civic symbol, it now resides in the Accademia Gallery under climate control to prevent micro-fractures in the marble.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Michelangelo%27s_David_-_right_view_2.jpg/800px-Michelangelo%27s_David_-_right_view_2.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/David_(Michelangelo)"
          },
          {
            "date": "1503-1519",
            "title": "Mona Lisa",
            "description": "Leonardo da Vinci's portrait revolutionized art with sfumato technique, creating soft transitions between tones. The subject's enigmatic smile results from 40+ glaze layers, each taking weeks to dry. Stolen in 1911 and recovered in 1913, it's now displayed in the Louvre behind bulletproof glass, attracting millions with its optical illusions and mysterious history.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Mona_Lisa%2C_by_Leonardo_da_Vinci%2C_from_C2RMF_retouched.jpg/800px-Mona_Lisa%2C_by_Leonardo_da_Vinci%2C_from_C2RMF_retouched.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Mona_Lisa"
          },
          {
            "date": "1508-1512",
            "title": "Sistine Chapel Ceiling",
            "description": "Michelangelo painted this monumental fresco cycle while lying on scaffolding over four years. The nine Genesis panels, surrounded by prophets and ignudi, showcase revolutionary anatomical precision. The Creation of Adam's hand motif became iconic. Restorations removed centuries of candle soot, revealing vibrant original colors that influenced High Renaissance aesthetics.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Michelangelo_-_Creation_of_Adam_(cropped).jpg/800px-Michelangelo_-_Creation_of_Adam_(cropped).jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Sistine_Chapel_ceiling"
          },
          {
            "date": "1485-1486",
            "title": "Birth of Venus",
            "description": "Botticelli's tempera panel reimagined classical mythology for the Medici family. Venus stands on a scallop shell, blown ashore by Zephyr winds. The flat modeling and decorative linearity influenced Pre-Raphaelites. Rediscovered in the 19th century, it now undergoes regular infrared scans at Florence's Uffizi to monitor fragile egg-based paint layers.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Sandro_Botticelli_-_La_nascita_di_Venere_-_Google_Art_Project_-_edited.jpg/800px-Sandro_Botticelli_-_La_nascita_di_Venere_-_Google_Art_Project_-_edited.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Birth_of_Venus"
          },
          {
            "date": "1495-1498",
            "title": "The Last Supper",
            "description": "Leonardo's experimental mural in Milan used oil-tempera hybrid on dry plaster, leading to rapid deterioration. The composition's vanishing point behind Christ's head and dramatic gestures created unprecedented narrative tension. Multiple restorations have stabilized surviving fragments, revealing original details like the spilled salt cellar near Judas.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/%C3%9Altima_Cena_-_Da_Vinci_5.jpg/800px-%C3%9Altima_Cena_-_Da_Vinci_5.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Last_Supper_(Leonardo)"
          },
          {
            "date": "1510-1511",
            "title": "School of Athens",
            "description": "Raphael's Vatican fresco epitomizes Renaissance humanism, depicting Plato, Aristotle, and ancient thinkers in a grand architectural setting. The composition balances perspective geometry with lively figures, including Michelangelo as Heraclitus. Recent cleaning revealed underdrawings showing Raphael's design process for this masterpiece of High Renaissance harmony.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Raffaello_Scuola_di_Atene.jpg/800px-Raffaello_Scuola_di_Atene.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_School_of_Athens"
          },
          {
            "date": "1425-1452",
            "title": "Gates of Paradise",
            "description": "Ghiberti's gilded bronze doors for Florence Baptistery took 27 years to complete. The 10 relief panels showcase revolutionary linear perspective and classical references. Michelangelo declared them worthy to be Paradise's gates. After severe flood damage, original panels were moved to Museo dell'Opera del Duomo, with replicas now in situ.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Gates_of_Paradise.jpg/800px-Gates_of_Paradise.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Gates_of_Paradise"
          },
          {
            "date": "1475-1480",
            "title": "Primavera",
            "description": "Botticelli's allegorical masterpiece for Lorenzo de' Medici features over 500 identified plant species amidst mythological figures. The complex iconography may celebrate Neoplatonic love or Medici weddings. Infrared imaging shows multiple compositional changes beneath the fragile tempera surface now carefully preserved at the Uffizi.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Sandro_Botticelli_-_La_primavera_-_Google_Art_Project.jpg/800px-Sandro_Botticelli_-_La_primavera_-_Google_Art_Project.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Primavera_(Botticelli)"
          }
        ]
      },
      "impressionism": {
        "title": "Impressionism",
        "description": "19th century movement capturing light and modern life",
        "events": [
          {
            "date": "1872",
            "title": "Impression, Sunrise",
            "description": "Monet's Le Havre harbor scene gave the movement its name when exhibited in 1874. Critics mocked its sketch-like quality, but the luminous atmosphere and loose brushwork became Impressionist hallmarks. Stolen from Musée Marmottan in 1985 and recovered in 1990, it now has enhanced security. Analysis shows original vibrant colors obscured by aged varnish.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Claude_Monet_-_Impression%2C_Sunrise_-_Google_Art_Project.jpg/800px-Claude_Monet_-_Impression%2C_Sunrise_-_Google_Art_Project.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Impression,_Sunrise"
          },
          {
            "date": "1876",
            "title": "Bal du moulin de la Galette",
            "description": "Renoir's large-scale Parisian scene captures working-class leisure with dappled sunlight filtering through trees. Painted en plein air using friends as models, its apparent spontaneity conceals careful planning - infrared reveals numerous revisions. Damaged by humidity and overcleaning, it underwent meticulous restoration before returning to Musée d'Orsay.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Pierre-Auguste_Renoir%2C_Le_Moulin_de_la_Galette.jpg/800px-Pierre-Auguste_Renoir%2C_Le_Moulin_de_la_Galette.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Bal_du_moulin_de_la_Galette"
          },
          {
            "date": "1874",
            "title": "The Dance Class",
            "description": "Degas' backstage ballet scene demonstrates his mastery of artificial lighting and unconventional angles. Using preparatory sketches and wax models, he composed this complex grouping of dancers in various states of rest and motion. The work's pastel palette and cropped figures show Japanese print influences.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Edgar_Degas_-_The_Dance_Class_-_Google_Art_Project.jpg/800px-Edgar_Degas_-_The_Dance_Class_-_Google_Art_Project.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Dance_Class"
          },
          {
            "date": "1889",
            "title": "The Starry Night",
            "description": "Van Gogh painted this swirling nightscape from his Saint-Rémy asylum window, combining observation with imagination. The vibrant blues and yellows were achieved with innovative impasto techniques. Though he considered it a failure, it became iconic. The painting's chemical changes are studied to preserve its unstable pigments at MoMA.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Van_Gogh_-_Starry_Night_-_Google_Art_Project.jpg/800px-Van_Gogh_-_Starry_Night_-_Google_Art_Project.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Starry_Night"
          },
          {
            "date": "1884-1886",
            "title": "A Sunday Afternoon on the Island of La Grande Jatte",
            "description": "Seurat's pointillist masterpiece took two years to complete, with countless preparatory studies. The 6.5-foot canvas contains approximately 3.5 million hand-painted dots. Scientific analysis reveals Seurat altered key elements, including removing a standing woman's bustle. The work's geometric stillness contrasts with Impressionist spontaneity.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/A_Sunday_on_La_Grande_Jatte%2C_Georges_Seurat%2C_1884.jpg/800px-A_Sunday_on_La_Grande_Jatte%2C_Georges_Seurat%2C_1884.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/A_Sunday_Afternoon_on_the_Island_of_La_Grande_Jatte"
          },
          {
            "date": "1877",
            "title": "The Railway",
            "description": "Manet's daring composition depicts a young girl and woman at Gare Saint-Lazare, with steam obscuring the train. The iron fence divides the space while allowing visual connection, showcasing modern Parisian life. Critics initially rejected its unconventional perspective and abrupt cropping, now celebrated as proto-modernist innovation.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/%C3%89douard_Manet_-_The_Railway_-_Google_Art_Project.jpg/800px-%C3%89douard_Manet_-_The_Railway_-_Google_Art_Project.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Railway_(painting)"
          },
          {
            "date": "1881",
            "title": "Luncheon of the Boating Party",
            "description": "Renoir's vibrant composition captures friends at Maison Fournaise restaurant along the Seine. The complex grouping includes future wife Aline Charigot and art patron Gustave Caillebotte. X-rays show Renoir radically altered positions during painting. The work's shimmering light effects represent peak Impressionist technique before his classical turn.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Pierre-Auguste_Renoir%2C_Le_d%C3%A9jeuner_des_canotiers.jpg/800px-Pierre-Auguste_Renoir%2C_Le_d%C3%A9jeuner_des_canotiers.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Luncheon_of_the_Boating_Party"
          },
          {
            "date": "1892-1894",
            "title": "Rouen Cathedral Series",
            "description": "Monet painted over 30 versions of Rouen Cathedral's façade at different times of day. Working in temporary studios across the square, he captured changing light effects with thick impasto. The series demonstrates his serial approach, with individual canvases now dispersed worldwide after breaking up the group against his wishes.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Claude_Monet_-_Rouen_Cathedral%2C_Facade_%28sunset%29_-_Google_Art_Project.jpg/800px-Claude_Monet_-_Rouen_Cathedral%2C_Facade_%28sunset%29_-_Google_Art_Project.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Rouen_Cathedral_(Monet)"
          }
        ]
      },
      "baroque": {
        "title": "Baroque",
        "description": "17th century dramatic style of exaggerated motion and detail",
        "events": [
          {
            "date": "1622",
            "title": "The Rape of Proserpina",
            "description": "Bernini's marble masterpiece captures Pluto abducting Proserpina with astonishing realism - his fingers appear to sink into her thigh. Carved when Bernini was just 23, the twisting composition and textural contrasts (smooth skin vs. rough drapery) epitomize Baroque dynamism. Now in Rome's Borghese Gallery, it's protected from vibrations that could damage the delicate struts.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/The_Rape_of_Proserpina_-_Bernini_1621-22.jpg/800px-The_Rape_of_Proserpina_-_Bernini_1621-22.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Rape_of_Proserpina"
          },
          {
            "date": "1599-1600",
            "title": "The Calling of Saint Matthew",
            "description": "Caravaggio's revolutionary religious scene uses dramatic chiaroscuro to spotlight Matthew's moment of conversion. The diagonal light beam and contemporary costumes brought biblical drama into the present. Infrared reveals Caravaggio made major compositional changes directly on the canvas while working. Now in San Luigi dei Francesi, its naturalism shocked contemporaries but influenced generations.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Caravaggio_-_The_Calling_of_Saint_Matthew.jpg/800px-Caravaggio_-_The_Calling_of_Saint_Matthew.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Calling_of_St_Matthew_(Caravaggio)"
          },
          {
            "date": "1633-1634",
            "title": "The Night Watch",
            "description": "Rembrandt's colossal group portrait broke conventions by showing Amsterdam's civic guards in dynamic action rather than static poses. The dramatic lighting and implied movement create theatrical energy. Trimmed in 1715 to fit Amsterdam's town hall, missing sections are known from copies. Recent restoration revealed subtle color nuances in the darkened varnish layers.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/The_Nightwatch_-_HD.jpg/800px-The_Nightwatch_-_HD.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Night_Watch"
          },
          {
            "date": "1656",
            "title": "Las Meninas",
            "description": "Velázquez's enigmatic court scene plays with mirrors and perspective to involve viewers in its complex narrative. The artist included himself painting a canvas while Princess Margarita is attended by maids. Infrared shows Velázquez radically adjusted figures during painting. The work's spatial illusions and meta-commentary on art-making influenced modern painters like Picasso.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Las_Meninas%2C_by_Diego_Vel%C3%A1zquez%2C_from_Prado_in_Google_Earth.jpg/800px-Las_Meninas%2C_by_Diego_Vel%C3%A1zquez%2C_from_Prado_in_Google_Earth.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Las_Meninas"
          },
          {
            "date": "1610",
            "title": "Judith Beheading Holofernes",
            "description": "Caravaggio's violent biblical scene shocked viewers with its graphic realism and dramatic lighting. The blood-spurting neck and Judith's determined expression create visceral impact. Recently rediscovered under a French attic's mattress, technical analysis confirms it as Caravaggio's original, not a copy. The work demonstrates his mastery of tenebrism and psychological intensity.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Caravaggio_-_Judith_Beheading_Holofernes_-_Google_Art_Project.jpg/800px-Caravaggio_-_Judith_Beheading_Holofernes_-_Google_Art_Project.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Judith_Beheading_Holofernes_(Caravaggio)"
          },
          {
            "date": "1612-1614",
            "title": "The Descent from the Cross",
            "description": "Rubens' triptych for Antwerp Cathedral combines Baroque dynamism with Flemish precision. The central panel's spiraling composition guides viewers through the emotional scene. Rubens used live models and preliminary oil sketches to perfect the dramatic lighting and musculature. The work established his reputation as Europe's leading religious painter.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Peter_Paul_Rubens_-_The_Descent_from_the_Cross_-_Google_Art_Project.jpg/800px-Peter_Paul_Rubens_-_The_Descent_from_the_Cross_-_Google_Art_Project.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Descent_from_the_Cross_(Rubens)"
          },
          {
            "date": "1647-1651",
            "title": "Ecstasy of Saint Teresa",
            "description": "Bernini's Cornaro Chapel masterpiece combines sculpture, architecture and lighting to create mystical theater. The floating saint and angel are carved from single marble blocks, with hidden windows illuminating the gilded bronze rays. The work's erotic overtones sparked controversy but became Counter-Reformation propaganda.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Estasi_di_Santa_Teresa.jpg/800px-Estasi_di_Santa_Teresa.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Ecstasy_of_Saint_Teresa"
          },
          {
            "date": "1658",
            "title": "The Maids of Honor",
            "description": "Velázquez's late masterpiece depicts the Infanta Margarita and her attendants in the artist's studio. The complex spatial arrangement, with the king and queen reflected in a distant mirror, creates multiple viewpoints. The painter's inclusion of himself working on a large canvas reflects on art's nature. The work's loose brushwork anticipates Impressionism.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Las_Meninas%2C_by_Diego_Vel%C3%A1zquez%2C_from_Prado_in_Google_Earth.jpg/800px-Las_Meninas%2C_by_Diego_Vel%C3%A1zquez%2C_from_Prado_in_Google_Earth.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Las_Meninas"
          }
        ]
      },
      "modernism": {
        "title": "Modernism",
        "description": "Early 20th century avant-garde movements breaking tradition",
        "events": [
          {
            "date": "1907",
            "title": "Les Demoiselles d'Avignon",
            "description": "Picasso's radical painting fractured perspective with African mask-inspired faces, birthing Cubism. The brothel scene's jagged forms shocked even his avant-garde circle. Studies show Picasso made over 800 preparatory sketches. Now at MoMA, its primal energy and spatial distortions influenced generations of modern artists.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Pablo_Picasso%2C_1907%2C_Les_Demoiselles_d%27Avignon%2C_oil_on_canvas%2C_243.9_x_233.7_cm%2C_Museum_of_Modern_Art.jpg/800px-Pablo_Picasso%2C_1907%2C_Les_Demoiselles_d%27Avignon%2C_oil_on_canvas%2C_243.9_x_233.7_cm%2C_Museum_of_Modern_Art.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Les_Demoiselles_d%27Avignon"
          },
          {
            "date": "1915",
            "title": "Black Square",
            "description": "Malevich's iconic Suprematist work reduced art to its geometric essence. The seemingly simple black square on white ground represented 'zero form' - art freed from representation. Cracks in the pigment reveal technical challenges in creating pure flatness. Multiple versions exist, with the original now showing significant deterioration.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Kazimir_Malevich%2C_1915%2C_Black_Suprematic_Square%2C_oil_on_linen_canvas%2C_79.5_x_79.5_cm%2C_Tretyakov_Gallery%2C_Moscow.jpg/800px-Kazimir_Malevich%2C_1915%2C_Black_Suprematic_Square%2C_oil_on_linen_canvas%2C_79.5_x_79.5_cm%2C_Tretyakov_Gallery%2C_Moscow.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Black_Square_(painting)"
          },
          {
            "date": "1921",
            "title": "The Persistence of Memory",
            "description": "Dalí's surrealist masterpiece features melting clocks in a dreamlike landscape. The ants on the orange clock represent decay, while the distorted face may be a self-portrait. Painted during Dalí's 'paranoiac-critical' period, its eerie precision creates unsettling realism. The small canvas (9.5 x 13 inches) packs immense psychological impact at MoMA.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/The_Persistence_of_Memory.jpg/800px-The_Persistence_of_Memory.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Persistence_of_Memory"
          },
          {
            "date": "1937",
            "title": "Guernica",
            "description": "Picasso's monumental anti-war mural responds to the Nazi bombing of Guernica. The monochromatic cubist composition crams agonized figures into claustrophobic space. Rented to MoMA for decades per Picasso's request, it returned to Spain only after democracy was restored. Infrared studies reveal extensive revisions beneath the surface.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Pablo_Picasso%2C_1937%2C_Guernica%2C_Museo_Reina_Sofia.jpg/800px-Pablo_Picasso%2C_1937%2C_Guernica%2C_Museo_Reina_Sofia.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Guernica_(Picasso)"
          },
          {
            "date": "1912",
            "title": "Nude Descending a Staircase",
            "description": "Duchamp's controversial painting merged Cubism with motion studies, showing sequential movement like chronophotography. Rejected by Cubists for being too Futurist, it caused a scandal at the 1913 Armory Show. The work's mechanical rendering of the human form foreshadowed Duchamp's later readymades.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Marcel_Duchamp%2C_1912%2C_Nu_descendant_un_escalier_n%C2%B02%2C_oil_on_canvas%2C_147_x_89.2_cm%2C_Philadelphia_Museum_of_Art.jpg/800px-Marcel_Duchamp%2C_1912%2C_Nu_descendant_un_escalier_n%C2%B02%2C_oil_on_canvas%2C_147_x_89.2_cm%2C_Philadelphia_Museum_of_Art.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Nude_Descending_a_Staircase,_No._2"
          },
          {
            "date": "1929",
            "title": "The Treachery of Images",
            "description": "Magritte's painting of a pipe with 'This is not a pipe' text challenges representation versus reality. Part of his word-image series, it demonstrates Surrealist interest in semiotics. The work's playful paradox influenced Conceptual Art and remains endlessly reproduced in philosophy textbooks.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/MagrittePipe.jpg/800px-MagrittePipe.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Treachery_of_Images"
          },
          {
            "date": "1950",
            "title": "Autumn Rhythm (Number 30)",
            "description": "Pollock's monumental drip painting exemplifies Abstract Expressionist energy. Created by pouring and flinging enamel paint onto unstretched canvas on his studio floor, it captures physical movement frozen in time. The work's all-over composition lacks focal points, immersing viewers in its rhythmic web.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Jackson_Pollock_-_Autumn_Rhythm_%28Number_30%29_-_Google_Art_Project.jpg/800px-Jackson_Pollock_-_Autumn_Rhythm_%28Number_30%29_-_Google_Art_Project.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Autumn_Rhythm_(Number_30)"
          },
          {
            "date": "1962",
            "title": "Campbell's Soup Cans",
            "description": "Warhol's 32 canvases of soup flavors launched Pop Art by elevating mass production to fine art. Hand-painted with slight variations, they critique consumer culture and artistic originality. First exhibited stacked on shelves like grocery store inventory, the work now symbolizes art's democratization.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Andy_Warhol_Campbell_Soup_Cans_MOMA_1962.jpg/800px-Andy_Warhol_Campbell_Soup_Cans_MOMA_1962.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Campbell%27s_Soup_Cans"
          }
        ]
      },
      "digital": {
        "title": "Digital Art",
        "description": "Late 20th-21st century computer-based art forms",
        "events": [
          {
            "date": "1967",
            "title": "Hommage à Paul Klee",
            "description": "Frieder Nake's algorithmic plotter drawing, created at the University of Stuttgart, was among the first computer artworks sold. Using the ALGOL programming language, Nake translated Klee's abstract style into mathematical instructions for the ZUSE Graphomat Z64 plotter. This pioneering work demonstrated how algorithms could reinterpret artistic styles, bridging Bauhaus principles with emerging digital aesthetics. The piece's precise yet organic lines challenged notions of artistic authorship in the computer age.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Frieder_Nake_Hommage_a_Paul_Klee_1965.jpg/800px-Frieder_Nake_Hommage_a_Paul_Klee_1965.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Frieder_Nake"
          },
          {
            "date": "1986",
            "title": "The Magic Hand of Chance",
            "description": "Harold Cohen's AARON program created this autonomous drawing at the Tate Gallery, marking a milestone in AI art. The software's rule-based system could make compositional decisions without human intervention, producing unique works that evolved over time. Cohen continued refining AARON for decades, with later versions incorporating color and more complex forms. The project raised enduring questions about creativity and machine agency in art-making.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/AARON_at_work.jpg/800px-AARON_at_work.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/AARON"
          },
          {
            "date": "1993",
            "title": "Osmose",
            "description": "Char Davies' groundbreaking VR installation at the Musée d'art contemporain de Montréal immersed participants in a semi-transparent 3D world navigated by breathing. Using a head-mounted display and motion tracking, it created an unprecedented embodied digital experience. The work's flowing, organic visuals contrasted with typical VR of the time, anticipating contemporary interest in digital naturalism and mindfulness technologies.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Osmose_installation_view.jpg/800px-Osmose_installation_view.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Osmose"
          },
          {
            "date": "2001",
            "title": "Every Icon",
            "description": "John F. Simon Jr.'s software art theoretically generates every possible 32x32 black-and-white icon through systematic permutation. Displayed on a handheld LCD screen, the work visualizes the staggering scale of combinatorial possibilities - at one icon per second, displaying all variations would take longer than the universe's current age. This conceptual piece bridges digital minimalism with profound mathematical implications about infinity and time.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Every_Icon_installation.jpg/800px-Every_Icon_installation.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Every_Icon"
          },
          {
            "date": "2007",
            "title": "The Treachery of Sanctuary",
            "description": "Chris Milk's interactive triptych at the Creators Project used Kinect sensors to transform viewers' shadows into fluttering birds and dissolving figures. Projected on massive screens, the work reimagined digital interactivity as poetic bodily engagement. Its three-stage narrative structure - birth, death, and transformation - demonstrated how technology could create visceral emotional experiences beyond traditional media.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Treachery_of_Sanctuary_installation.jpg/800px-Treachery_of_Sanctuary_installation.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Chris_Milk"
          },
          {
            "date": "2018",
            "title": "Portrait of Edmond de Belamy",
            "description": "The first AI-generated artwork sold at Christie's, created by Paris-based collective Obvious using a GAN (Generative Adversarial Network). The algorithm trained on 15,000 portraits from the 14th-20th centuries before producing this blurry, anachronistic image. Its auction for $432,500 sparked global debate about authorship, value, and the nature of creativity in machine learning systems.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Edmond_de_Belamy.png/800px-Edmond_de_Belamy.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Portrait_of_Edmond_de_Belamy"
          },
          {
            "date": "2021",
            "title": "The First 5000 Days",
            "description": "Beeple's (Mike Winkelmann) NFT collage sold at Christie's for $69 million, becoming the most expensive digital artwork ever. The monumental JPEG file comprises daily digital images created consecutively since 2007, documenting the artist's evolving style and internet culture. The sale legitimized NFTs in the traditional art market while sparking debates about speculation versus artistic merit in crypto art.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Beeple_-_Everydays_-_The_First_5000_Days.jpg/800px-Beeple_-_Everydays_-_The_First_5000_Days.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Everydays:_the_First_5000_Days"
          },
          {
            "date": "2023",
            "title": "Next Rembrandt",
            "description": "A Microsoft-led project used deep learning to analyze Rembrandt's complete works, then generated a new 'original' portrait matching his style. The algorithm considered composition, lighting, brushwork, and even 3D texture to create a physically printed painting. While controversial, the project demonstrated AI's potential for artistic reconstruction and style emulation at unprecedented fidelity.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/The_Next_Rembrandt_project.jpg/800px-The_Next_Rembrandt_project.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Next_Rembrandt"
          }
        ]
      }
    }
  },
    "history": {
    "title": "World History Timeline",
    "description": "Pivotal events that shaped human civilization from antiquity to modern era",
    "subtopics": {
      "ancient": {
        "title": "Ancient Civilizations",
        "description": "Foundational cultures and empires from 3000 BCE to 500 CE",
        "events": [
          {
            "date": "c. 2560 BCE",
            "title": "Great Pyramid of Giza Completed",
            "description": "Built as Pharaoh Khufu's tomb, this 481-foot pyramid employed 20,000 workers over 20 years using 2.3 million stone blocks. Its precise alignment to cardinal directions and sophisticated interior chambers demonstrate advanced Egyptian mathematics and engineering. The last surviving Wonder of the Ancient World, it remained the tallest man-made structure for 3,800 years. Modern scans reveal hidden chambers and new details about construction techniques.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Kheops-Pyramid.jpg/800px-Kheops-Pyramid.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Great_Pyramid_of_Giza"
          },
          {
            "date": "c. 1772 BCE",
            "title": "Code of Hammurabi",
            "description": "This 7-foot basalt stele established Babylon's legal system with 282 laws covering contracts, property, and family matters. The 'eye for an eye' principle appears in Law #196. Discovered in 1901 in Susa, it now resides in the Louvre. The top relief shows Hammurabi receiving authority from Shamash, the sun god, establishing divine justification for royal power in Mesopotamian culture.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Code_of_Hammurabi.jpg/800px-Code_of_Hammurabi.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Code_of_Hammurabi"
          },
          {
            "date": "1200-900 BCE",
            "title": "Olmec Colossal Heads",
            "description": "The Olmec civilization carved 17 basalt portrait heads weighing 6-50 tons, likely depicting rulers. Transported 60+ miles without wheeled vehicles, they demonstrate early Mesoamerican stoneworking mastery. The largest (Head 1 at La Venta) stands 9.8 feet tall. Recent mineral analysis traces their stone to the Tuxtla Mountains volcanic region, revealing extensive trade networks.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Olmec_Colossal_Head_1.jpg/800px-Olmec_Colossal_Head_1.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Olmec_colossal_heads"
          },
          {
            "date": "490 BCE",
            "title": "Battle of Marathon",
            "description": "Athens' 10,000 hoplites defeated 25,000 Persians through superior tactics, losing only 192 men versus 6,400 Persian casualties. Pheidippides' legendary 26-mile run to announce victory inspired the modern marathon. The battle preserved Greek independence and demonstrated the effectiveness of phalanx warfare. Recent archaeological surveys have refined our understanding of the battle's location and movements.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Battle_of_Marathon_Initial_Situation.png/800px-Battle_of_Marathon_Initial_Situation.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Battle_of_Marathon"
          },
          {
            "date": "221 BCE",
            "title": "Qin Dynasty Unifies China",
            "description": "Qin Shi Huang conquered six warring states, standardizing writing, currency, and measurements. His Terracotta Army (8,000+ life-sized figures) guarded his tomb near Xi'an. The Great Wall's first unified construction began under his rule. While lasting only 15 years, the Qin established China's imperial model for two millennia. DNA studies of workers' remains reveal diverse origins across ancient China.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Terracotta_Army%2C_View_of_Pit_1.jpg/800px-Terracotta_Army%2C_View_of_Pit_1.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Qin_dynasty"
          },
          {
            "date": "44 BCE",
            "title": "Assassination of Julius Caesar",
            "description": "On the Ides of March, 60 senators stabbed Caesar 23 times in Pompey's Theatre, fearing his dictatorship threatened the Republic. This triggered civil wars leading to Augustus' imperial rule. Forensic analysis suggests only one wound (to the chest) was fatal. Shakespeare's dramatization popularized the phrase 'Et tu, Brute?' though historical accounts don't confirm these last words.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Vincenzo_Camuccini_-_La_morte_di_Cesare.jpg/800px-Vincenzo_Camuccini_-_La_morte_di_Cesare.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Assassination_of_Julius_Caesar"
          },
          {
            "date": "79 CE",
            "title": "Eruption of Mount Vesuvius",
            "description": "The volcano buried Pompeii and Herculaneum under 20 feet of ash, preserving Roman daily life. Pliny the Younger's eyewitness account describes pyroclastic flows reaching 100+ mph. Modern CT scans of plaster casts reveal victims' clothing, facial features, and even their last meals. The event killed 16,000+ but provided unparalleled archaeological insights into 1st-century Roman culture.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Pompeii_-_Via_dell%27Abbondanza_-_Panorama.jpg/800px-Pompeii_-_Via_dell%27Abbondanza_-_Panorama.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Eruption_of_Mount_Vesuvius_in_79_AD"
          },
          {
            "date": "476 CE",
            "title": "Fall of Western Roman Empire",
            "description": "Germanic leader Odoacer deposed Emperor Romulus Augustulus, ending 500 years of Roman rule in the West. While often overstated as a sudden collapse, the empire had been decentralizing for decades. The Eastern Empire continued as Byzantium for another millennium. Recent scholarship emphasizes continuity in administration and culture during this 'transition' period rather than abrupt decline.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Romulus_Augustus_lands_in_Naples_-_Henryk_Siemiradzki.jpg/800px-Romulus_Augustus_lands_in_Naples_-_Henryk_Siemiradzki.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Fall_of_the_Western_Roman_Empire"
          }
        ]
      },
      "medieval": {
        "title": "Medieval Period",
        "description": "European and global developments from 500-1500 CE",
        "events": [
          {
            "date": "800",
            "title": "Charlemagne Crowned Emperor",
            "description": "Pope Leo III crowned the Frankish king as 'Emperor of the Romans' on Christmas Day, reviving the Western imperial title. Charlemagne's 46-year rule standardized weights, measures, and the Carolingian minuscule script that became the basis for modern European alphabets. His palace school at Aachen attracted scholars like Alcuin, sparking the Carolingian Renaissance. DNA evidence suggests he was likely 6 feet tall - exceptionally large for the era.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Albrecht_D%C3%BCrer_-_Charlemagne_-_WGA07064.jpg/800px-Albrecht_D%C3%BCrer_-_Charlemagne_-_WGA07064.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Charlemagne"
          },
          {
            "date": "1066",
            "title": "Norman Conquest of England",
            "description": "William the Conqueror's victory at Hastings ended Anglo-Saxon rule, introducing Norman French as England's elite language. The Bayeux Tapestry's 230-foot embroidery documents the campaign in 58 scenes. Domesday Book (1086) recorded England's first comprehensive land survey. Recent isotope analysis of bones at Battle Abbey confirms the fighting's precise location described in chronicles.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Bayeux_Tapestry_scene57_harold_death.jpg/800px-Bayeux_Tapestry_scene57_harold_death.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Norman_Conquest"
          },
          {
            "date": "1095-1099",
            "title": "First Crusade",
            "description": "Pope Urban II launched the campaign to reclaim Jerusalem from Muslim rule at the Council of Clermont. The People's Crusade massacred Jews in the Rhineland before the main forces captured Jerusalem in 1099, killing thousands. The Crusader States lasted until 1291. New research shows many crusaders were younger sons seeking land rather than solely religiously motivated.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Entry_of_the_crusaders_into_Constantinople_-_Delacroix.jpg/800px-Entry_of_the_crusaders_into_Constantinople_-_Delacroix.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/First_Crusade"
          },
          {
            "date": "1206",
            "title": "Genghis Khan Unites Mongols",
            "description": "Temüjin became Genghis Khan, creating history's largest contiguous empire through innovative cavalry tactics and meritocracy. His Yam messenger system and legal code (Yassa) administered 12 million square miles. DNA studies suggest he has 16 million modern descendants. Recent scholarship emphasizes his religious tolerance and the Pax Mongolica's role in global trade.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/YuanEmperorAlbumGenghisPortrait.jpg/800px-YuanEmperorAlbumGenghisPortrait.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Genghis_Khan"
          },
          {
            "date": "1347-1351",
            "title": "Black Death",
            "description": "Yersinia pestis bacteria killed 30-60% of Europe's population via fleas on black rats. The pandemic originated in Central Asia, spreading along trade routes. Social upheaval included pogroms against Jews and the decline of feudalism. Recent plague pit excavations in London reveal victims buried in emergency mass graves with careful Christian rites despite the chaos.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Bubonic_plague_victim.jpg/800px-Bubonic_plague_victim.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Black_Death"
          },
          {
            "date": "1431",
            "title": "Joan of Arc Burned at Stake",
            "description": "The 19-year-old French peasant girl who led armies against the English was tried for heresy and cross-dressing in Rouen. Her visions and military successes revived French morale during the Hundred Years' War. Forensic analysis of trial records suggests she may have had epilepsy or tuberculosis. Canonized in 1920, she remains France's patron saint.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Joan_of_Arc_at_the_Stake_by_Hermann_Stilke.jpg/800px-Joan_of_Arc_at_the_Stake_by_Hermann_Stilke.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Joan_of_Arc"
          },
          {
            "date": "1453",
            "title": "Fall of Constantinople",
            "description": "Mehmed II's Ottoman forces breached the Theodosian Walls after 53 days using massive cannons, ending the 1,500-year Byzantine Empire. The event spurred European exploration for new trade routes. Hagia Sophia became a mosque, its Christian mosaics plastered over until 20th-century restoration. Greek scholars fleeing westward helped spark the Renaissance.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Constantinople_1453.jpg/800px-Constantinople_1453.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Fall_of_Constantinople"
          },
          {
            "date": "1492",
            "title": "Reconquista Completed",
            "description": "Ferdinand and Isabella conquered Granada, ending 781 years of Muslim rule in Iberia. The Alhambra Decree expelled Jews, damaging Spain's economy. Columbus' voyage that year began European colonization of the Americas. Recent archaeological work reveals hidden Jewish prayer rooms in medieval Spanish homes.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/La_rendici%C3%B3n_de_Granada_-_Pradilla.jpg/800px-La_rendici%C3%B3n_de_Granada_-_Pradilla.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Reconquista"
          }
        ]
      },
      "renaissance": {
        "title": "Renaissance Era",
        "description": "Cultural and scientific rebirth in Europe (14th-17th century)",
        "events": [
          {
            "date": "1440",
            "title": "Gutenberg Printing Press",
            "description": "Johannes Gutenberg's movable type system in Mainz enabled mass book production, spreading literacy and ideas. His 42-line Bible (1455) was the first major printed work. By 1500, 20 million books were printed across Europe. Recent ink analysis reveals his secret formula used copper and lead for durability.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Gutenberg_bible.jpg/800px-Gutenberg_bible.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Printing_press"
          },
          {
            "date": "1497-1499",
            "title": "Da Vinci's The Last Supper",
            "description": "Leonardo's experimental mural in Milan used oil-tempera on dry plaster, causing rapid deterioration. The composition's vanishing point behind Christ and Judas' spilled salt create dramatic tension. Restorers have removed overpainting to reveal original details like the Apostles' expressive hands. The refectory's humidity control system now preserves this iconic work.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/%C3%9Altima_Cena_-_Da_Vinci_5.jpg/800px-%C3%9Altima_Cena_-_Da_Vinci_5.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Last_Supper_(Leonardo)"
          },
          {
            "date": "1517",
            "title": "Protestant Reformation Begins",
            "description": "Martin Luther's 95 Theses criticized Church corruption and indulgences, nailing them to Wittenberg's Castle Church door. The printing press spread his ideas, fracturing Western Christianity. Luther's German Bible translation standardized the language. New research shows his theological breakthrough came while lecturing on Psalms, not during a thunderstorm as legend claims.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Luther_at_the_Diet_of_Worms.jpg/800px-Luther_at_the_Diet_of_Worms.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Protestant_Reformation"
          },
          {
            "date": "1543",
            "title": "Copernican Revolution",
            "description": "Nicolaus Copernicus published 'On the Revolutions' proposing a heliocentric solar system on his deathbed. His calculations matched observations better than Ptolemy's geocentric model but faced Church opposition. Galileo's later telescopic evidence supported the theory. Modern analysis shows Copernicus likely developed his ideas while studying in Italy, not isolated in Poland.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Nikolaus_Kopernikus.jpg/800px-Nikolaus_Kopernikus.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Copernican_Revolution"
          },
          {
            "date": "1588",
            "title": "Spanish Armada Defeated",
            "description": "England's smaller, maneuverable ships and storms destroyed Philip II's 130-ship fleet attempting invasion. The victory preserved Protestant England and established naval tactics using cannon broadsides. Wreck archaeology reveals many Spanish ships were converted merchant vessels unsuitable for combat. The event marked Spain's decline and England's rise as a sea power.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Armada_portrait_of_Elizabeth_I_(1590).jpg/800px-Armada_portrait_of_Elizabeth_I_(1590).jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Spanish_Armada"
          },
          {
            "date": "1600",
            "title": "Giordano Bruno Burned",
            "description": "The Dominican friar was executed for heresy after proposing infinite universes and cosmic pluralism. His pantheistic philosophy challenged Church doctrine more radically than Galileo. Modern philosophers recognize him as a martyr for scientific free thought. The exact location of his burning in Rome's Campo de' Fiori is marked by a statue erected in 1889.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Giordano_Bruno.jpg/800px-Giordano_Bruno.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Giordano_Bruno"
          },
          {
            "date": "1618-1648",
            "title": "Thirty Years' War",
            "description": "This devastating European conflict began as Protestant-Catholic strife but became a Habsburg-Bourbon power struggle. The Peace of Westphalia established modern state sovereignty and reduced papal influence. Germany lost 20% of its population. Recent research emphasizes the war's environmental impact through widespread deforestation and farmland destruction.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Slaughter_on_Hrad%C4%8Dany_Square_during_the_Swedish_occupation_of_Prague.jpg/800px-Slaughter_on_Hrad%C4%8Dany_Square_during_the_Swedish_occupation_of_Prague.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Thirty_Years%27_War"
          },
          {
            "date": "1687",
            "title": "Newton's Principia Published",
            "description": "Isaac Newton's 'Mathematical Principles of Natural Philosophy' formulated laws of motion and universal gravitation. Written in Latin, it united celestial and terrestrial physics under mathematical principles. The work established calculus (though Leibniz independently developed it) and dominated scientific thought until Einstein. Recent studies of Newton's manuscripts reveal he nearly abandoned the project until Halley's encouragement.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Principia-title.png/800px-Principia-title.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Philosophi%C3%A6_Naturalis_Principia_Mathematica"
          }
        ]
      },
      "industrial": {
        "title": "Industrial Revolution",
        "description": "Technological and social transformations (18th-19th century)",
        "events": [
          {
            "date": "1769",
            "title": "Watt's Steam Engine Patent",
            "description": "James Watt's separate condenser improved Newcomen's engine efficiency by 75%, powering factories and mines. His partnership with Boulton commercialized the technology. The engine's power measurement in 'horsepower' terms helped customers understand its value. Recent analysis of Watt's notebooks shows he struggled for years to perfect the condenser's sealing mechanism.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Boulton_%26_Watt_steam_engine_1784.png/800px-Boulton_%26_Watt_steam_engine_1784.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Watt_steam_engine"
          },
          {
            "date": "1779",
            "title": "Iron Bridge Constructed",
            "description": "The world's first cast iron bridge spanned England's Severn Gorge, demonstrating new construction materials. Abraham Darby III used 378 tons of iron from nearby Coalbrookdale. The arch design was based on wooden bridge principles. Modern laser scans monitor structural movements in this UNESCO World Heritage site that symbolizes the Industrial Age.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/The_Iron_Bridge_-_geograph.org.uk_-_1360836.jpg/800px-The_Iron_Bridge_-_geograph.org.uk_-_1360836.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Iron_Bridge"
          },
          {
            "date": "1830",
            "title": "Liverpool-Manchester Railway",
            "description": "The first intercity passenger railway used Stephenson's Rocket locomotive, reaching 30 mph. The line proved steam transport's viability, with scheduled timetables and separate tracks. William Huskisson became the first railway fatality when struck by Rocket. Archaeological work has uncovered original trackbed sections showing early rail construction methods.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Rocket_drawing.jpg/800px-Rocket_drawing.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Liverpool_and_Manchester_Railway"
          },
          {
            "date": "1839",
            "title": "First Photograph of a Person",
            "description": "Louis Daguerre's Paris boulevard image accidentally captured a man getting his shoes shined during the 10-minute exposure. This daguerreotype process launched practical photography. The unidentified man is thus history's first photographed human. Modern imaging techniques have enhanced details in this seminal image at the Musée des Arts et Métiers.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Boulevard_du_Temple_by_Daguerre.jpg/800px-Boulevard_du_Temple_by_Daguerre.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Boulevard_du_Temple"
          },
          {
            "date": "1848",
            "title": "Communist Manifesto Published",
            "description": "Marx and Engels' pamphlet analyzed class struggle amid industrial capitalism's upheavals. Written during European revolutions, it called for worker solidarity against bourgeois exploitation. The text's famous opening line ('A specter is haunting Europe') reflected its urgent tone. Recent scholarship examines how the Manifesto's reception varied dramatically by country based on local labor conditions.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Karl_Marx_and_Friedrich_Engels_%28Trial_version%29.jpg/800px-Karl_Marx_and_Friedrich_Engels_%28Trial_version%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Communist_Manifesto"
          },
          {
            "date": "1851",
            "title": "Great Exhibition",
            "description": "London's Crystal Palace showcased global industrial innovations to 6 million visitors. The glass-and-iron structure covered 19 acres, demonstrating prefabrication techniques. Exhibits ranged from steam engines to Koh-i-Noor diamond. Profit funded London's Science Museum and Victoria & Albert Museum. Recent recreations using VR show how the building's transparency symbolized progress.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Crystal_Palace_-_General_view_from_Water_Temple.jpg/800px-Crystal_Palace_-_General_view_from_Water_Temple.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Great_Exhibition"
          },
          {
            "date": "1869",
            "title": "Suez Canal Opens",
            "description": "Ferdinand de Lesseps' 120-mile canal cut Europe-Asia travel distance by 4,300 miles. Built by 1.5 million workers (many forced laborers), it used innovative dredging technology. Britain gained control in 1875, securing its imperial route to India. Modern expansions in 2015 doubled its capacity, though giant container ships now face limitations.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Suez_Canal_Aerial.jpg/800px-Suez_Canal_Aerial.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Suez_Canal"
          },
          {
            "date": "1876",
            "title": "Bell Patents Telephone",
            "description": "Alexander Graham Bell's device for 'transmitting vocal sounds telegraphically' launched global communications revolution. Controversy persists over whether Elisha Gray or Antonio Meucci preceded him. The first intelligible words ('Mr. Watson, come here') were spoken in Boston. Early telephones used at Chicago's 1876 World's Fair amazed visitors with real-time distant conversations.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Alexander_Graham_Bell.jpg/800px-Alexander_Graham_Bell.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Telephone"
          }
        ]
      },
      "modern": {
        "title": "Modern History",
        "description": "Global developments from 20th century to present",
        "events": [
          {
            "date": "1914-1918",
            "title": "World War I",
            "description": "The Great War killed 20 million through trench warfare, chemical weapons, and new technologies like tanks. Archduke Franz Ferdinand's assassination triggered complex alliances. The Treaty of Versailles' harsh terms planted seeds for WWII. Recent forensic anthropology work continues identifying remains from mass graves on the Western Front.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Bundesarchiv_Bild_183-R05148%2C_Westfront%2C_verwundeter_Engl%C3%A4nder.jpg/800px-Bundesarchiv_Bild_183-R05148%2C_Westfront%2C_verwundeter_Engl%C3%A4nder.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/World_War_I"
          },
          {
            "date": "1929",
            "title": "Great Depression Begins",
            "description": "The U.S. stock market crash triggered global economic collapse, with unemployment reaching 25% in America. Dust Bowl droughts compounded agricultural crises. FDR's New Deal programs like Social Security reformed capitalism. New research shows how unequal wealth distribution and agricultural overproduction made the crisis especially severe.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Unemployed_men_queued_outside_a_depression_soup_kitchen_opened_in_Chicago_by_Al_Capone%2C_02-1931_-_NARA_-_541927.jpg/800px-Unemployed_men_queued_outside_a_depression_soup_kitchen_opened_in_Chicago_by_Al_Capone%2C_02-1931_-_NARA_-_541927.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Great_Depression"
          },
          {
            "date": "1945",
            "title": "Atomic Bombs Dropped",
            "description": "Hiroshima (August 6) and Nagasaki (August 9) bombings killed 200,000+, leading to Japan's surrender. The Manhattan Project's $2 billion (2023 value) effort involved 130,000 people across secret sites. Debate continues over the morality and military necessity. Hibakusha (survivors) have documented long-term radiation effects through organizations like Nihon Hidankyo.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Nagasakibomb.jpg/800px-Nagasakibomb.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Atomic_bombings_of_Hiroshima_and_Nagasaki"
          },
          {
            "date": "1969",
            "title": "Moon Landing",
            "description": "Apollo 11's Neil Armstrong and Buzz Aldrin walked on the lunar surface while Collins orbited above. The 400,000-person NASA effort achieved JFK's 1961 challenge. Armstrong's 'one small step' line was partially improvised. Laser reflectors left on the surface still provide precise Earth-Moon distance measurements.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Aldrin_Apollo_11_original.jpg/800px-Aldrin_Apollo_11_original.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Apollo_11"
          },
          {
            "date": "1989",
            "title": "Berlin Wall Falls",
            "description": "Peaceful protests and political changes led to East Germany opening border crossings on November 9. Citizens began dismantling the 28-mile barrier that had divided the city since 1961. The event symbolized Communism's collapse in Eastern Europe. Fragments are now displayed worldwide, with the largest section at the East Side Gallery.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Berlinermauer.jpg/800px-Berlinermauer.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Fall_of_the_Berlin_Wall"
          },
          {
            "date": "2001",
            "title": "9/11 Attacks",
            "description": "Al-Qaeda hijackers crashed planes into the World Trade Center and Pentagon, killing 2,977 people. The Twin Towers' collapse demonstrated skyscraper vulnerabilities to progressive collapse. The event triggered the War on Terror and homeland security reforms. The 9/11 Memorial's reflecting pools now occupy the towers' footprints, with names of victims inscribed along the edges.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/World_Trade_Center_9-11_Attack_%28a%29.jpg/800px-World_Trade_Center_9-11_Attack_%28a%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/September_11_attacks"
          },
          {
            "date": "2008",
            "title": "Global Financial Crisis",
            "description": "Lehman Brothers' collapse exposed subprime mortgage risks, causing worldwide economic turmoil. Governments spent $10+ trillion on bailouts and stimulus. Bitcoin emerged as alternative currency in response. Dodd-Frank reforms aimed to prevent recurrence. Recent research shows how shadow banking and derivatives magnified the crisis beyond traditional banking systems.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Lehman_Brothers_Headquarters.jpg/800px-Lehman_Brothers_Headquarters.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Financial_crisis_of_2007%E2%80%932008"
          },
          {
            "date": "2020",
            "title": "COVID-19 Pandemic",
            "description": "The novel coronavirus infected 700+ million globally, killing 7+ million by 2023. Lockdowns, mRNA vaccines, and remote work transformed societies. WHO declared a pandemic on March 11 after initial outbreaks in Wuhan. The crisis accelerated telemedicine and exposed healthcare inequalities. Ongoing research tracks long-term effects like 'long COVID' neurological impacts.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/COVID-19_pandemic_in_Italy_%282020-03%29.jpg/800px-COVID-19_pandemic_in_Italy_%282020-03%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/COVID-19_pandemic"
          }
        ]
      }
    }
  },
   
    "space": {
    "title": "Space Exploration",
    "description": "Milestones in humanity's journey beyond Earth",
    "subtopics": {
      "spaceflight": {
        "title": "Human Spaceflight",
        "description": "Key moments in crewed space exploration",
        "events": [
          {
            "date": "1961-04-12",
            "title": "Yuri Gagarin - First Human in Space",
            "description": "The Soviet cosmonaut completed one orbit aboard Vostok 1, lasting 108 minutes. His spacecraft had no landing system - Gagarin ejected at 7km altitude and parachuted separately. This mission began the space race in earnest, with the US responding with Project Mercury. Gagarin became an international celebrity, with his 'Poyekhali!' (Let's go!) launch phrase entering history.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Yuri_Gagarin_in_Sweden_-_original.jpg/800px-Yuri_Gagarin_in_Sweden_-_original.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Yuri_Gagarin"
          },
          {
            "date": "1969-07-20",
            "title": "Apollo 11 Moon Landing",
            "description": "Neil Armstrong and Buzz Aldrin landed Eagle on the Moon's Sea of Tranquility while Michael Collins orbited above. Armstrong's first step onto the lunar surface ('That's one small step...') was broadcast to 600 million viewers. The astronauts collected 21.5kg of samples and left scientific instruments. This fulfilled JFK's 1961 challenge and marked America's victory in the Space Race.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Aldrin_Apollo_11_original.jpg/800px-Aldrin_Apollo_11_original.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Apollo_11"
          },
          {
            "date": "1971-04-19",
            "title": "First Space Station - Salyut 1",
            "description": "The USSR launched this 20-ton station that hosted one crew (Soyuz 11) for 23 days. The cosmonauts died during reentry due to cabin depressurization. Salyut 1 pioneered long-duration space habitation concepts later used on Skylab and Mir. It reentered after 175 days, but established the template for modular space stations.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Salyut_1_in_orbit.jpg/800px-Salyut_1_in_orbit.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Salyut_1"
          },
          {
            "date": "1981-04-12",
            "title": "First Space Shuttle Launch",
            "description": "Columbia's STS-1 mission demonstrated reusable spacecraft technology with John Young and Robert Crippen. The 54-hour test flight verified the orbiter's systems despite losing 16 heat shield tiles. The Shuttle program would fly 135 missions over 30 years before retirement in 2011. Its legacy includes satellite deployment, Hubble servicing, and ISS construction.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/STS-1_launch.jpg/800px-STS-1_launch.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Space_Shuttle_program"
          },
          {
            "date": "1998-11-20",
            "title": "ISS First Module Launched",
            "description": "Russia's Zarya module initiated International Space Station construction. Now weighing 420 tons, the ISS has hosted continuous human presence since 2000. Jointly operated by 5 space agencies, it serves as a microgravity lab testing technologies for future Moon/Mars missions. Its solar arrays span an acre and are visible from Earth as the third brightest object in the night sky.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/International_Space_Station_after_undocking_of_STS-132.jpg/800px-International_Space_Station_after_undocking_of_STS-132.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/International_Space_Station"
          },
          {
            "date": "2004-10-04",
            "title": "SpaceShipOne Wins Ansari X Prize",
            "description": "This private suborbital spacecraft completed two crewed flights within two weeks, reaching 100km altitude. Funded by Paul Allen and designed by Burt Rutan, it demonstrated reusable commercial spaceflight viability. The technology led to Virgin Galactic's SpaceShipTwo. The carbon-composite craft now hangs in the Smithsonian's Air and Space Museum.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/SpaceShipOne_in_flight.jpg/800px-SpaceShipOne_in_flight.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/SpaceShipOne"
          },
          {
            "date": "2020-05-30",
            "title": "First Commercial Crew Launch",
            "description": "SpaceX's Crew Dragon carried NASA astronauts to the ISS, restoring US crewed launch capability after the Shuttle's retirement. The reusable capsule autonomously docked with the station. This marked NASA's shift to purchasing commercial crew services. The mission's success validated public-private partnerships for human spaceflight.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/SpaceX_Demo-2_Launch_%28NHQ202005300043%29.jpg/800px-SpaceX_Demo-2_Launch_%28NHQ202005300043%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Crew_Dragon_Demo-2"
          },
          {
            "date": "2021-07-11",
            "title": "Branson's Virgin Galactic Flight",
            "description": "Richard Branson reached 86km altitude aboard VSS Unity, beating Bezos to become the first billionaire in space on his own spacecraft. The suborbital flight tested passenger experience for future space tourism. Critics noted it didn't reach the Kármán line (100km), but demonstrated private citizen space access potential.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/VSS_Unity_gliding_after_release_from_VMS_Eve.jpg/800px-VSS_Unity_gliding_after_release_from_VMS_Eve.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Virgin_Galactic_Unity_22"
          }
        ]
      },
      "planetary": {
        "title": "Planetary Exploration",
        "description": "Robotic missions to other worlds",
        "events": [
          {
            "date": "1972-12-11",
            "title": "Last Human Moon Mission - Apollo 17",
            "description": "Gene Cernan and Harrison Schmitt spent 75 hours on the Moon while Ronald Evans orbited. They collected 110kg of samples including 'orange soil' volcanic glass. The mission featured the first scientist-astronaut (Schmitt) and longest lunar rover traverses (35km). Cernan's last words on the Moon ('We leave as we came...') marked the end of human lunar exploration until Artemis.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Apollo_17_Flag_on_the_Moon.jpg/800px-Apollo_17_Flag_on_the_Moon.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Apollo_17"
          },
          {
            "date": "1977-09-05",
            "title": "Voyager 1 Launch",
            "description": "This NASA probe conducted flybys of Jupiter (1979) and Saturn (1980) before entering interstellar space in 2012. It carries the Golden Record with sounds/images representing Earth. Now over 24 billion km away, it remains operational, transmitting data from beyond our solar system. Its Pale Blue Dot photo shows Earth as a tiny speck in cosmic vastness.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Voyager_spacecraft_model.png/800px-Voyager_spacecraft_model.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Voyager_1"
          },
          {
            "date": "1990-04-24",
            "title": "Hubble Space Telescope Launch",
            "description": "Deployed by Discovery's STS-31 crew, Hubble revolutionized astronomy despite initial mirror flaws corrected in 1993. Its ultra-deep field images reveal galaxies from the early universe. Servicing missions upgraded instruments until 2009. Still operational after 30+ years, Hubble has made over 1.5 million observations, contributing to 20,000+ scientific papers.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Hubble_01.jpg/800px-Hubble_01.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Hubble_Space_Telescope"
          },
          {
            "date": "2005-01-14",
            "title": "Huygens Lands on Titan",
            "description": "The ESA probe descended through Saturn's moon Titan's atmosphere, surviving 2.5 hours on the surface. It revealed river channels carved by liquid methane and an Earth-like nitrogen atmosphere. Data suggested a subsurface ocean, making Titan a prime astrobiology target. The mission marked humanity's most distant landing to date.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Huygens_surface_color.jpg/800px-Huygens_surface_color.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Huygens_(spacecraft)"
          },
          {
            "date": "2015-07-14",
            "title": "New Horizons at Pluto",
            "description": "NASA's flyby revealed Pluto's heart-shaped glacier (Tombaugh Regio) and icy mountains. The probe continued to Arrokoth in 2019, the most distant object ever visited. Data transmission took 16 months due to Pluto's distance. The mission redefined our understanding of Kuiper Belt objects as complex worlds.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Pluto_in_True_Color_-_High-Res.jpg/800px-Pluto_in_True_Color_-_High-Res.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/New_Horizons"
          },
          {
            "date": "2019-01-01",
            "title": "New Horizons at Arrokoth",
            "description": "The spacecraft flew by this 36km-long Kuiper Belt object, revealing its unusual 'snowman' shape from two merged lobes. Arrokoth's pristine condition provides clues to solar system formation. The mission's success at such distance demonstrated precise navigation capabilities for future interstellar probes.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Arrokoth_-_Ultima_Thule.png/800px-Arrokoth_-_Ultima_Thule.png",
            "searchUrl": "https://en.wikipedia.org/wiki/486958_Arrokoth"
          },
          {
            "date": "2020-12-03",
            "title": "Chang'e 5 Lunar Sample Return",
            "description": "China's mission collected 1.731kg of Moon rocks from Mons Rümker, the first lunar samples since 1976. The spacecraft used automated orbital docking to transfer samples to the return capsule. Analysis revealed younger volcanic rocks than Apollo samples, revising lunar geological timelines.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Chang%27e-5_mission_animation.gif/800px-Chang%27e-5_mission_animation.gif",
            "searchUrl": "https://en.wikipedia.org/wiki/Chang%27e_5"
          },
          {
            "date": "2021-12-25",
            "title": "James Webb Space Telescope Launch",
            "description": "The $10 billion successor to Hubble deployed successfully after years of delays. Its 6.5m segmented mirror and infrared instruments peer through dust to study early galaxy formation. Located at L2 point 1.5 million km away, it began science operations in 2022, already capturing stunning images of nebulae and exoplanet atmospheres.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Webb_deploy.gif/800px-Webb_deploy.gif",
            "searchUrl": "https://en.wikipedia.org/wiki/James_Webb_Space_Telescope"
          }
        ]
      },
      "astronomy": {
        "title": "Astronomy Discoveries",
        "description": "Groundbreaking observations of the cosmos",
        "events": [
          {
            "date": "1609-1610",
            "title": "Galileo's Telescope Observations",
            "description": "Using his improved 20x telescope, Galileo discovered Jupiter's four largest moons, lunar craters, and Milky Way stars. These observations supported Copernican heliocentrism, contradicting Church doctrine. His drawings of moon phases and sunspots demonstrated celestial imperfection, challenging Aristotelian cosmology. These findings were published in 'Sidereus Nuncius' (1610).",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Galileo.arp.300pix.jpg/800px-Galileo.arp.300pix.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Galileo_Galilei"
          },
          {
            "date": "1781-03-13",
            "title": "Discovery of Uranus",
            "description": "William Herschel identified Uranus while surveying stars, initially mistaking it for a comet. Its anomalous orbit led to Neptune's mathematical prediction. The discovery doubled the known solar system's size. Herschel named it 'Georgium Sidus' after King George III, but international consensus adopted Uranus from Greek mythology.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Uranus2.jpg/800px-Uranus2.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Uranus"
          },
          {
            "date": "1929",
            "title": "Hubble's Law of Cosmic Expansion",
            "description": "Edwin Hubble correlated galaxies' redshifts with distances, proving the universe expands. This supported Lemaître's Big Bang theory over steady-state models. The Hubble constant quantifies expansion rate, critical for estimating universe age (~13.8B years). Later observations of accelerating expansion (1998) implied dark energy's existence.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Edwin_Hubble_with_pipe_1928.jpg/800px-Edwin_Hubble_with_pipe_1928.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Hubble%27s_law"
          },
          {
            "date": "1965",
            "title": "Cosmic Microwave Background Discovery",
            "description": "Penzias and Wilson at Bell Labs detected the 2.725K radiation, the Big Bang's afterglow. This confirmed Gamow's prediction and ruled out rival theories. COBE (1992) mapped its anisotropies, revealing early universe density variations. Precision measurements now constrain dark matter/energy parameters to <1% uncertainty.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Cmbr.svg/800px-Cmbr.svg.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Cosmic_microwave_background"
          },
          {
            "date": "1995-10-06",
            "title": "First Exoplanet Around Sun-like Star",
            "description": "Michel Mayor and Didier Queloz discovered 51 Pegasi b, a 'hot Jupiter' orbiting every 4.2 days. Using radial velocity measurements, they proved planets could exist around main-sequence stars. This launched the exoplanet revolution - over 5,000 are now confirmed. They shared the 2019 Nobel Prize in Physics for this discovery.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Artist%27s_impression_of_the_exoplanet_51_Pegasi_b.jpg/800px-Artist%27s_impression_of_the_exoplanet_51_Pegasi_b.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/51_Pegasi_b"
          },
          {
            "date": "2016-02-11",
            "title": "Gravitational Waves Detected",
            "description": "LIGO observed ripples in spacetime from two merging black holes (1.3B light-years away), confirming Einstein's 1916 prediction. The signal lasted 0.2 seconds, with peak power 50× the observable universe's luminosity. This opened gravitational-wave astronomy, allowing study of cosmic events invisible to telescopes. Weiss, Barish, and Thorne received the 2017 Nobel Prize.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/LIGO_measurement_of_gravitational_waves.svg/800px-LIGO_measurement_of_gravitational_waves.svg.png",
            "searchUrl": "https://en.wikipedia.org/wiki/First_observation_of_gravitational_waves"
          },
          {
            "date": "2019-04-10",
            "title": "First Black Hole Image",
            "description": "The Event Horizon Telescope collaboration released M87*'s image showing a bright ring around its shadow. The 6.5B-solar-mass black hole's appearance matched general relativity predictions. Achieving this required synchronizing telescopes globally and processing petabytes of data. The image provided direct visual proof of black holes' existence.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/M87_black_hole_in_polarised_light.jpg/800px-M87_black_hole_in_polarised_light.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/First_image_of_a_black_hole"
          },
          {
            "date": "2022-07-12",
            "title": "JWST First Science Images",
            "description": "NASA released stunning infrared images including galaxy cluster SMACS 0723 and the Carina Nebula. Webb's unprecedented resolution revealed early universe galaxies (300M years post-Big Bang) and exoplanet atmospheric compositions. The telescope's 6.5m gold-coated mirror operates at -223°C to detect faint infrared signals from the cosmos' earliest light.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Webb%27s_First_Deep_Field_%28NIRCam_Image%29_%28cropped%29.jpg/800px-Webb%27s_First_Deep_Field_%28NIRCam_Image%29_%28cropped%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/James_Webb_Space_Telescope"
          }
        ]
      },
      "mars": {
        "title": "Mars Exploration",
        "description": "Robotic missions to the Red Planet",
        "events": [
          {
            "date": "1976-07-20",
            "title": "Viking 1 Lands on Mars",
            "description": "NASA's first successful Mars lander operated for 6 years, conducting biology experiments and photographing the surface. Its labeled release experiment initially suggested microbial activity, though results remain debated. Viking's high-resolution images (300m/pixel from orbit) mapped potential future landing sites. The mission established Mars as a complex geological world.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Viking_Lander_1_site.jpg/800px-Viking_Lander_1_site.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Viking_1"
          },
          {
            "date": "1997-07-04",
            "title": "Pathfinder & Sojourner Rover",
            "description": "This NASA mission delivered the first rover to Mars - the 10.6kg Sojourner that operated for 83 days. The lander used innovative airbags rather than rockets, a technique later adopted for Spirit and Opportunity. Sojourner analyzed rocks like 'Barnacle Bill' with an alpha proton X-ray spectrometer, proving small rovers' scientific value.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Mars_Pathfinder_Lander.jpg/800px-Mars_Pathfinder_Lander.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Mars_Pathfinder"
          },
          {
            "date": "2004-01-25",
            "title": "Opportunity Rover Lands",
            "description": "Designed for 90 days, this golf-cart-sized rover operated for 14 years, covering 45km - a record. It discovered evidence of ancient water at Endeavour Crater before succumbing to a dust storm. Its 'hole in one' landing in Eagle Crater immediately revealed bedrock showing past aqueous deposition.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Mars_rover_Opportunity_working_on_Mars.jpg/800px-Mars_rover_Opportunity_working_on_Mars.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Opportunity_(rover)"
          },
          {
            "date": "2012-08-06",
            "title": "Curiosity Rover Lands",
            "description": "NASA's car-sized rover made a dramatic sky crane landing in Gale Crater. Its nuclear-powered mission studies Mars' habitability, discovering organic molecules and seasonal methane variations. Curiosity climbed Mount Sharp, analyzing sedimentary layers that record billions of years of Martian environmental changes.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Curiosity_Self-Portrait_at_%27Big_Sky%27_Drilling_Site.jpg/800px-Curiosity_Self-Portrait_at_%27Big_Sky%27_Drilling_Site.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Curiosity_(rover)"
          },
          {
            "date": "2018-11-26",
            "title": "InSight Lander Arrives",
            "description": "This stationary NASA mission studied Mars' interior using a seismometer that detected over 1,300 marsquakes. The heat probe (mole) failed to penetrate as planned, but data revealed a larger liquid core and thinner crust than expected. InSight's weather station provided continuous atmospheric measurements until power loss in 2022.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/InSight_lander_on_Mars_%28artist%27s_concept%29.jpg/800px-InSight_lander_on_Mars_%28artist%27s_concept%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/InSight"
          },
          {
            "date": "2021-02-18",
            "title": "Perseverance Rover Lands",
            "description": "NASA's latest rover touched down in Jezero Crater, an ancient lakebed. It carries the Ingenuity helicopter that made the first powered flight on another world. Perseverance drills core samples for future return to Earth and produces oxygen from CO2. Its mission focuses on astrobiology and preparing for human exploration.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Perseverance%27s_landing_site_-_Jezero_Crater.jpg/800px-Perseverance%27s_landing_site_-_Jezero_Crater.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Perseverance_(rover)"
          },
          {
            "date": "2021-04-19",
            "title": "Ingenuity First Flight",
            "description": "The 1.8kg helicopter made the first powered extraterrestrial flight, lasting 39 seconds. Designed for 5 flights, it has completed 50+ as of 2023, scouting terrain for Perseverance. Its carbon-fiber blades spin at 2,400 rpm to generate lift in Mars' thin atmosphere. The mission proved aerial exploration is possible on other worlds.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Ingenuity%27s_first_flight_%28animated%29.gif/800px-Ingenuity%27s_first_flight_%28animated%29.gif",
            "searchUrl": "https://en.wikipedia.org/wiki/Ingenuity_(helicopter)"
          },
          {
            "date": "2023-04-20",
            "title": "ESA's Mars Sample Return Plans",
            "description": "The European Space Agency finalized designs to retrieve Perseverance's samples in the 2030s. This multi-mission effort involves a NASA fetch rover, ESA ascent vehicle, and Earth Return Orbiter. If successful, it would be the first material returned from Mars, allowing laboratory analysis impossible with rover instruments alone.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Mars_Sample_Return_mission_concept.jpg/800px-Mars_Sample_Return_mission_concept.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Mars_sample-return_mission"
          }
        ]
      },
      "technology": {
        "title": "Space Technology",
        "description": "Innovations enabling space exploration",
        "events": [
          {
            "date": "1957-10-04",
            "title": "Sputnik 1 Launch",
            "description": "The Soviet Union's 58cm aluminum sphere was the first artificial satellite, orbiting every 96 minutes. Its radio beeps shocked America, sparking the Space Race. Sputnik's success demonstrated orbital mechanics and led to NASA's creation. The satellite burned up after 3 months, but its impact reshaped global politics and science education.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Sputnik_asm.jpg/800px-Sputnik_asm.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Sputnik_1"
          },
          {
            "date": "1960-04-01",
            "title": "TIROS-1 - First Weather Satellite",
            "description": "NASA's Television Infrared Observation Satellite transmitted the first space-based weather images. Despite operating only 78 days, it proved satellites could monitor global cloud patterns. Modern meteorology relies on TIROS' descendants like GOES and Himawari. The original black-and-white images showed storm systems with unprecedented clarity.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/TIROS-1_satellite.jpg/800px-TIROS-1_satellite.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/TIROS-1"
          },
          {
            "date": "1976-09-03",
            "title": "Viking Biological Experiments",
            "description": "NASA's Viking landers conducted three life-detection tests on Martian soil. The labeled release experiment initially showed metabolic activity, but the gas chromatograph found no organic molecules. This paradox remains unresolved - some scientists argue for oxidizing soil chemistry rather than biology. The experiments set the standard for extraterrestrial life detection protocols.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Viking_Lander_simulated_test_-_GPN-2000-001677.jpg/800px-Viking_Lander_simulated_test_-_GPN-2000-001677.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Viking_lander_biological_experiments"
          },
          {
            "date": "1998-11-20",
            "title": "ISS Construction Begins",
            "description": "Russia's Zarya module launched first, followed by NASA's Unity. The station's assembly required 40+ missions over 13 years. Its modular design allows continuous upgrades - new components like the Axiom modules will extend its life beyond 2030. The ISS serves as a testbed for long-duration spaceflight and international cooperation.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/International_Space_Station_after_undocking_of_STS-132.jpg/800px-International_Space_Station_after_undocking_of_STS-132.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/International_Space_Station"
          },
          {
            "date": "2015-12-21",
            "title": "Falcon 9 First Stage Landing",
            "description": "SpaceX successfully landed an orbital rocket's first stage after launch, a milestone in reusability. The booster touched down at Cape Canaveral, demonstrating precision GPS and engine control. This achievement reduced launch costs and paved the way for routine booster reuse - some Falcon 9 first stages have flown 15+ missions.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Falcon_9_first_stage_landing_after_OG2_mission.jpg/800px-Falcon_9_first_stage_landing_after_OG2_mission.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Falcon_9_first-stage_landing_tests"
          },
          {
            "date": "2019-03-02",
            "title": "Crew Dragon Demo-1 Docking",
            "description": "SpaceX's uncrewed spacecraft autonomously docked with the ISS, proving commercial crew capabilities. The mission validated life support systems and touchscreen controls. This paved the way for NASA's shift to purchasing crew transportation services rather than operating its own vehicles, a model now extending to lunar landers.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Crew_Dragon_approaches_ISS_%28cropped%29.jpg/800px-Crew_Dragon_approaches_ISS_%28cropped%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/SpaceX_Dragon_2"
          },
          {
            "date": "2022-11-16",
            "title": "Artemis I Launch",
            "description": "NASA's SLS megarocket sent an uncrewed Orion capsule around the Moon, testing systems for human return. The 25-day mission demonstrated heat shield performance and deep space navigation. Future Artemis missions aim to land astronauts, including the first woman, using SpaceX's Starship as a lunar lander.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Artemis_I_launch.jpg/800px-Artemis_I_launch.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Artemis_1"
          },
          {
            "date": "2023-04-20",
            "title": "Starship First Integrated Test",
            "description": "SpaceX's fully reusable super heavy-lift system reached 39km altitude before intentional destruction. Despite not reaching orbit, the test provided data on stage separation and Raptor engine performance. When operational, Starship could transport 100+ tons to the Moon or Mars, revolutionizing deep space exploration.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/SpaceX_Starship_launch_%28cropped%29.jpg/800px-SpaceX_Starship_launch_%28cropped%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/SpaceX_Starship"
          }
        ]
      }
    }
  },
  
    "medicine": {
    "title": "Medical Milestones",
    "description": "Breakthroughs that transformed healthcare and saved lives",
    "subtopics": {
      "discoveries": {
        "title": "Scientific Discoveries",
        "description": "Groundbreaking medical research and findings",
        "events": [
          {
            "date": "1796",
            "title": "First Smallpox Vaccine",
            "description": "Edward Jenner inoculated 8-year-old James Phipps with cowpox pus, proving immunity to smallpox. This built on milkmaids' observed resistance after cowpox exposure. Jenner's method replaced risky variolation, eventually eradicating smallpox by 1980. The term 'vaccine' derives from 'vacca' (Latin for cow), honoring this bovine connection to medical history.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Edward_Jenner._Oil_painting._Wellcome_L0005551.jpg/800px-Edward_Jenner._Oil_painting._Wellcome_L0005551.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Smallpox_vaccine"
          },
          {
            "date": "1847",
            "title": "Germ Theory of Disease",
            "description": "Ignaz Semmelweis demonstrated handwashing reduced childbirth fever deaths in Vienna hospitals. Though ridiculed, his work preceded Pasteur's 1861 germ theory confirmation. Semmelweis's mortality rates dropped from 18% to 2% using chlorinated lime solution. His ideas gained acceptance only after his death, founding modern antiseptic protocols.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Semmelweis_1860.jpg/800px-Semmelweis_1860.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Ignaz_Semmelweis"
          },
          {
            "date": "1928",
            "title": "Penicillin Discovered",
            "description": "Alexander Fleming noticed mold (Penicillium notatum) killing Staphylococcus bacteria in his London lab. Howard Florey and Ernst Chain later purified it, enabling mass production by 1942. This first antibiotic saved millions in WWII and revolutionized infection treatment. Fleming warned early about antibiotic resistance, now a major global health threat.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Penicillium_notatum.jpg/800px-Penicillium_notatum.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Penicillin"
          },
          {
            "date": "1953",
            "title": "DNA Structure Solved",
            "description": "James Watson and Francis Crick deduced the double helix using Rosalind Franklin's X-ray diffraction images. Their Nature paper revealed how base pairing enables genetic replication. Franklin's Photo 51 was crucial but uncredited until later. This launched molecular biology, explaining heredity and enabling genetic engineering. All three received Nobel recognition.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/DNA_Structure%2BKey%2BLabelled.pn_NoBB.png/800px-DNA_Structure%2BKey%2BLabelled.pn_NoBB.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Double_helix"
          },
          {
            "date": "1978",
            "title": "First IVF Baby Born",
            "description": "Louise Brown's birth in England validated Patrick Steptoe and Robert Edwards' in vitro fertilization technique. The procedure united egg and sperm outside the body before implantation. Initially controversial, IVF has since produced over 8 million babies. Edwards received the 2010 Nobel Prize for this reproductive medicine breakthrough.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Louise_Brown_and_her_son.jpg/800px-Louise_Brown_and_her_son.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Louise_Brown"
          },
          {
            "date": "1983",
            "title": "HIV Virus Identified",
            "description": "Luc Montagnier's team at Pasteur Institute isolated LAV (later called HIV), while Robert Gallo at NIH independently identified HTLV-III. Their rivalry delayed blood test development during the AIDS crisis. The discovery enabled antiretroviral therapies turning HIV from fatal to manageable. Both scientists eventually shared credit for this critical virology breakthrough.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/HIV-budding-Color.jpg/800px-HIV-budding-Color.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/HIV"
          },
          {
            "date": "2003",
            "title": "Human Genome Sequenced",
            "description": "The International Human Genome Project completed sequencing all 3 billion DNA base pairs after 13 years. This revealed humans have ~20,000 genes (fewer than predicted) and 99.9% genetic similarity. The $3B effort enabled personalized medicine and ancestry tracing. Private rival Celera accelerated progress with shotgun sequencing techniques.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/DNA_sequence_viewer.png/800px-DNA_sequence_viewer.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Human_Genome_Project"
          },
          {
            "date": "2020",
            "title": "CRISPR Gene Editing Nobel",
            "description": "Emmanuelle Charpentier and Jennifer Doudna won for adapting the bacterial CRISPR-Cas9 system into precise genetic scissors. This allows editing DNA sequences to correct mutations, treat diseases, or modify organisms. Ethical concerns arose after a 2018 CRISPR baby scandal in China. The technology promises cures for genetic disorders but requires careful regulation.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/CRISPR_flow_diagram.png/800px-CRISPR_flow_diagram.png",
            "searchUrl": "https://en.wikipedia.org/wiki/CRISPR_gene_editing"
          }
        ]
      },
      "technology": {
        "title": "Medical Technology",
        "description": "Innovative devices and diagnostic tools",
        "events": [
          {
            "date": "1895",
            "title": "X-rays Discovered",
            "description": "Wilhelm Röntgen noticed barium platinocyanide glowing during cathode ray experiments in Würzburg. His first X-ray image showed his wife's hand bones and wedding ring. Within months, hospitals adopted the technology despite unknown radiation risks. Röntgen refused to patent his discovery, wanting it freely available. He received the first Nobel Prize in Physics in 1901.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Hand-Roentgen-1896.jpg/800px-Hand-Roentgen-1896.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/X-ray"
          },
          {
            "date": "1927",
            "title": "First Iron Lung",
            "description": "Philip Drinker and Louis Shaw at Harvard developed this negative pressure ventilator for polio patients. The metal cylinder enclosed patients' bodies, using air pressure changes to force breathing. John Emerson later improved the design, cutting costs from $2,000 to $1,000. These machines saved thousands until polio vaccines made them obsolete.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Polio_ward_with_iron_lungs.jpg/800px-Polio_ward_with_iron_lungs.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Iron_lung"
          },
          {
            "date": "1958",
            "title": "First Pacemaker Implant",
            "description": "Swedish surgeon Åke Senning implanted Arne Larsson's battery-powered device in Stockholm. Earlier models were external and impractical. This implant used nickel-cadmium batteries lasting 2-3 years. Modern pacemakers are 5cm wide, use lithium batteries lasting 10+ years, and adjust heart rhythms automatically for 600,000+ patients annually.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Modern_pacemaker.jpg/800px-Modern_pacemaker.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Artificial_cardiac_pacemaker"
          },
          {
            "date": "1971",
            "title": "CT Scanner Invented",
            "description": "Godfrey Hounsfield's EMI scanner combined X-rays with computer processing to create cross-sectional body images. The first clinical scan took 9 hours to process brain data. Modern CT scans take seconds, with resolution under 0.5mm. Hounsfield shared the 1979 Nobel Prize with Allan Cormack for this diagnostic revolution.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/CT_Scanner.jpg/800px-CT_Scanner.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/CT_scan"
          },
          {
            "date": "1987",
            "title": "First Laparoscopic Surgery",
            "description": "French surgeon Philippe Mouret performed the first laparoscopic cholecystectomy (gallbladder removal) using tiny incisions and cameras. This minimally invasive technique reduced recovery time from weeks to days. By 1992, 50% of such surgeries used laparoscopy. Today's robotic systems like da Vinci enhance precision with 3D visualization.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Laparoscopic_surgery.jpg/800px-Laparoscopic_surgery.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Laparoscopic_surgery"
          },
          {
            "date": "2003",
            "title": "First Bionic Arm Implant",
            "description": "Jesse Sullivan received a thought-controlled prosthetic at Rehabilitation Institute of Chicago. Electrodes connected to his pectoral nerves allowed intuitive movement. Modern versions like the LUKE arm provide tactile feedback. Over 2,000 people now use advanced myoelectric prosthetics worldwide, restoring near-natural limb functionality.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Myoelectric_prosthetic_hand.jpg/800px-Myoelectric_prosthetic_hand.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Prosthesis"
          },
          {
            "date": "2017",
            "title": "Artificial Womb for Lambs",
            "description": "Children's Hospital of Philadelphia's Biobag sustained premature lambs equivalent to 23-week human fetuses. The fluid-filled environment with umbilical oxygen supply improved survival over incubators. Human trials could begin in 2025, potentially revolutionizing care for extremely premature babies currently facing 50-70% mortality rates.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Biobag_artificial_womb.jpg/800px-Biobag_artificial_womb.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Artificial_womb"
          },
          {
            "date": "2021",
            "title": "First 3D Printed Heart",
            "description": "Tel Aviv University scientists printed a rabbit-sized heart with human cells and blood vessels. While not functional, it demonstrated bioprinting's potential for organ transplants. Current research focuses on vascularization challenges to create viable organs. Over 100,000 people await transplants annually in the US alone, making this technology urgently needed.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/3D_bioprinting_process.jpg/800px-3D_bioprinting_process.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/3D_bioprinting"
          }
        ]
      },
      "pandemics": {
        "title": "Pandemics",
        "description": "Global disease outbreaks and responses",
        "events": [
          {
            "date": "1347-1351",
            "title": "Black Death",
            "description": "Yersinia pestis bacteria killed 30-60% of Europe's population via fleas on black rats. Originating in Central Asia, it spread along trade routes. Social upheaval included pogroms against Jews and the decline of feudalism. Recent DNA analysis of plague pits confirms the bacterium's strain and high fatality rate.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Bubonic_plague_victim.jpg/800px-Bubonic_plague_victim.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Black_Death"
          },
          {
            "date": "1918-1920",
            "title": "Spanish Flu",
            "description": "H1N1 influenza infected 500 million (1/3 of humanity), killing 50-100 million. Wartime censors suppressed reports, but neutral Spain's coverage gave the misleading name. Unusual mortality among young adults resulted from cytokine storms. Modern analysis suggests it originated in Kansas, not Spain, before spreading via troop movements.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/1918_flu_in_Oakland.jpg/800px-1918_flu_in_Oakland.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Spanish_flu"
          },
          {
            "date": "1952",
            "title": "Polio Epidemic Peaks",
            "description": "The US saw 58,000 cases, paralyzing 21,000 and killing 3,145, mostly children. Summer outbreaks closed pools and theaters. Jonas Salk's 1955 vaccine (injected) and Albert Sabin's 1961 oral version eventually eradicated polio in most countries. Global cases have decreased 99% since 1988, with wild polio remaining only in Afghanistan and Pakistan.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Polio_ward_with_iron_lungs.jpg/800px-Polio_ward_with_iron_lungs.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Polio"
          },
          {
            "date": "1981",
            "title": "AIDS Identified",
            "description": "CDC reported Pneumocystis pneumonia in 5 LA gay men, marking HIV/AIDS recognition. The retrovirus likely crossed from chimps to humans in 1920s Congo. By 2000, it caused 22 million deaths. Antiretroviral therapy (1996) turned HIV from fatal to manageable. UNAIDS reports 40 million live with HIV today, mostly in Africa.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/HIV-budding-Color.jpg/800px-HIV-budding-Color.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/HIV/AIDS"
          },
          {
            "date": "2002-2004",
            "title": "SARS Outbreak",
            "description": "Novel coronavirus SARS-CoV-1 infected 8,000+ across 29 countries, killing 774. Originating in Chinese bats via civets, it spread through Hong Kong's Metropole Hotel. Rapid quarantine measures contained it within 8 months. The outbreak demonstrated coronaviruses' pandemic potential and improved global outbreak response systems.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/SARS_CoV_electron_micrograph.jpg/800px-SARS_CoV_electron_micrograph.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/SARS"
          },
          {
            "date": "2014-2016",
            "title": "Ebola Epidemic",
            "description": "West Africa's outbreak infected 28,600, killing 11,325 - the deadliest Ebola event. Fruit bats likely transmitted it in Guinea, spreading to Liberia and Sierra Leone. Experimental vaccines like rVSV-ZEBOV showed 97.5% efficacy. The crisis prompted WHO reforms after delayed response criticism. Survivors face long-term neurological and ocular complications.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Ebola_Virus_Particles_%28colorized%29.jpg/800px-Ebola_Virus_Particles_%28colorized%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/West_African_Ebola_virus_epidemic"
          },
          {
            "date": "2019-2023",
            "title": "COVID-19 Pandemic",
            "description": "SARS-CoV-2 infected 700+ million globally, killing 7+ million by 2023. Likely originating in Wuhan's wildlife trade, it spread via respiratory droplets. Lockdowns, mRNA vaccines (Pfizer/Moderna), and antivirals (Paxlovid) mitigated impacts. WHO declared a pandemic on March 11, 2020. Long COVID affects 10-30% of survivors with lingering symptoms.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/COVID-19_pandemic_in_Italy_%282020-03%29.jpg/800px-COVID-19_pandemic_in_Italy_%282020-03%29.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/COVID-19_pandemic"
          },
          {
            "date": "2022",
            "title": "Mpox (Monkeypox) Outbreak",
            "description": "Formerly rare outside Africa, this orthopoxvirus spread globally through close contact. Over 87,000 cases occurred in 110 countries by 2023. The Clade II strain caused less severe illness than African Clade I. JYNNEOS vaccine effectiveness reached 85%. The outbreak highlighted zoonotic disease risks in an interconnected world.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Monkeypox_virus_3.jpg/800px-Monkeypox_virus_3.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/2022%E2%80%932023_mpox_outbreak"
          }
        ]
      },
      "surgery": {
        "title": "Surgical Advances",
        "description": "Innovations in operative techniques",
        "events": [
          {
            "date": "1846",
            "title": "First Public Ether Anesthesia",
            "description": "William Morton demonstrated painless tumor removal at Massachusetts General Hospital's 'Ether Dome.' Surgeon John Warren declared, 'Gentlemen, this is no humbug.' Earlier, Crawford Long had used ether but not published. This began modern anesthesia, though ether's flammability later prompted safer alternatives like halothane.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/First_use_of_ether_by_Morton.jpg/800px-First_use_of_ether_by_Morton.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Ether_dome"
          },
          {
            "date": "1867",
            "title": "Lister's Antiseptic Surgery",
            "description": "Joseph Lister reduced postoperative infections from 60% to 15% using carbolic acid spray in Glasgow. Inspired by Pasteur's germ theory, he sterilized instruments and wounds. Skeptical colleagues adopted his methods after seeing results. This founded aseptic technique, though Lister's original phenol solution irritated skin and lungs.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Joseph_Lister_Wellcome_M0000440.jpg/800px-Joseph_Lister_Wellcome_M0000440.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Joseph_Lister"
          },
          {
            "date": "1954",
            "title": "First Successful Organ Transplant",
            "description": "Joseph Murray transplanted a kidney between identical twins in Boston, avoiding rejection. The recipient lived 8 years with the donated organ. Murray later pioneered immunosuppressants for non-twin transplants, winning the 1990 Nobel Prize. Today, over 40,000 organ transplants occur annually worldwide with 1-year survival exceeding 90%.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Joseph_Murray_1990.jpg/800px-Joseph_Murray_1990.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Joseph_Murray"
          },
          {
            "date": "1967",
            "title": "First Heart Transplant",
            "description": "Christiaan Barnard replaced Louis Washkansky's failing heart in Cape Town. The patient lived 18 days before pneumonia death. Early transplants failed due to rejection until cyclosporine improved outcomes in the 1980s. Today, 3,500+ heart transplants occur yearly with 85% 1-year survival. Mechanical hearts now bridge patients awaiting donors.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Christiaan_Barnard.jpg/800px-Christiaan_Barnard.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Christiaan_Barnard"
          },
          {
            "date": "1985",
            "title": "First Laparoscopic Gallbladder Removal",
            "description": "Erich Mühe in Germany performed this minimally invasive cholecystectomy using a modified gastroscope. American surgeons later popularized the technique, reducing recovery from weeks to days. By 1992, 50% of such surgeries used laparoscopy. Today's robotic systems allow even greater precision with 3D visualization.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Laparoscopic_surgery.jpg/800px-Laparoscopic_surgery.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Laparoscopic_surgery"
          },
          {
            "date": "2005",
            "title": "First Face Transplant",
            "description": "French surgeons replaced Isabelle Dinoire's nose, lips and chin after a dog attack. The 15-hour operation used donor tissue matched for skin tone. She regained 90% facial function but died in 2016 from cancer unrelated to immunosuppressants. Over 40 face transplants have since been performed worldwide with varying outcomes.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Face_transplant_donor_and_recipient.jpg/800px-Face_transplant_donor_and_recipient.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Face_transplant"
          },
          {
            "date": "2011",
            "title": "First Artificial Windpipe Transplant",
            "description": "Surgeons in Sweden implanted a synthetic trachea seeded with patient's stem cells. The plastic scaffold avoided donor shortages and rejection risks. However, surgeon Paolo Macchiarini was later discredited for ethical violations and falsified data. The case highlighted regenerative medicine's promise and pitfalls.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Artificial_trachea.jpg/800px-Artificial_trachea.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Tracheal_transplant"
          },
          {
            "date": "2021",
            "title": "First Successful Pig-to-Human Heart Transplant",
            "description": "Maryland surgeons transplanted a genetically modified pig heart into David Bennett, who lived 2 months. The pig had 10 gene edits to reduce rejection. While not long-term successful, it proved xenotransplantation feasibility. Researchers continue modifying pig organs to address immune responses and endogenous viruses.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Pig_heart_transplant_2022.jpg/800px-Pig_heart_transplant_2022.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Xenotransplantation"
          }
        ]
      },
      "neuroscience": {
        "title": "Neuroscience",
        "description": "Discoveries about the brain and nervous system",
        "events": [
          {
            "date": "1873",
            "title": "Neuron Doctrine Formulated",
            "description": "Camillo Golgi's silver staining revealed neuron structures, while Santiago Ramón y Cajal proposed they were discrete cells (not a continuous network). Their shared 1906 Nobel Prize honored this foundational neuroscience concept. Electron microscopy later confirmed synapses between neurons, validating Cajal's theories about nervous system organization.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/CajalHippocampusPyramidalCell.png/800px-CajalHippocampusPyramidalCell.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Neuron_doctrine"
          },
          {
            "date": "1929",
            "title": "EEG Invented",
            "description": "Hans Berger recorded the first human electroencephalogram in Jena, detecting brainwave patterns. Alpha waves (8-12Hz) during relaxation became the first identified neural oscillation. EEG enabled epilepsy diagnosis and sleep research. Modern high-density arrays localize activity to millimeter precision, aiding brain-computer interfaces.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Hans_Berger_photo.jpg/800px-Hans_Berger_photo.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Electroencephalography"
          },
          {
            "date": "1952",
            "title": "Hodgkin-Huxley Model",
            "description": "Alan Hodgkin and Andrew Huxley mathematically described action potentials using squid giant axons. Their model explained nerve impulses via ion channels and membrane capacitance, earning the 1963 Nobel Prize. This remains neuroscience's quantitative gold standard, foundational for understanding neurological diseases and drug development.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Hodgkin_Huxley.jpg/800px-Hodgkin_Huxley.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Hodgkin%E2%80%93Huxley_model"
          },
          {
            "date": "1991",
            "title": "fMRI Developed",
            "description": "Seiji Ogawa demonstrated functional MRI could map brain activity via blood-oxygen-level-dependent (BOLD) signals. This noninvasive technique revolutionized cognitive neuroscience by localizing functions like language (Broca's area) and memory (hippocampus). Limitations include indirect neural measures (vascular, not electrical) and 1-2s temporal resolution.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/FMRI_of_the_brain.jpg/800px-FMRI_of_the_brain.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Functional_magnetic_resonance_imaging"
          },
          {
            "date": "2012",
            "title": "Optogenetics Breakthrough",
            "description": "Karl Deisseroth and Ed Boyden pioneered using light-sensitive algal proteins to control neurons genetically modified to express them. This 'remote control' of neural circuits clarified Parkinson's, depression, and addiction mechanisms in animal models. Clinical trials explore optogenetic vision restoration and epilepsy treatment in humans.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Optogenetics_Illustration.jpg/800px-Optogenetics_Illustration.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Optogenetics"
          },
          {
            "date": "2014",
            "title": "Brain Initiative Launched",
            "description": "The US BRAIN Project ($5B funding) aims to map neural circuits at single-cell resolution. Projects include dense electrode arrays (Neuropixels) and molecular census tools. Similar EU/Human Brain Project efforts work toward whole-brain simulations. Critics note excessive focus on technology over theory, but the initiative has accelerated neuroscience tools development.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/BRAIN_Initiative_Logo.png/800px-BRAIN_Initiative_Logo.png",
            "searchUrl": "https://en.wikipedia.org/wiki/BRAIN_Initiative"
          },
          {
            "date": "2020",
            "title": "AI Predicts Protein Folding",
            "description": "DeepMind's AlphaFold2 achieved atomic-level accuracy in predicting protein 3D structures from amino acid sequences. This solved a 50-year biology grand challenge, transforming neuroscience by modeling synaptic proteins critical for brain function. Applications range from drug design (Alzheimer's targets) to understanding prion diseases' misfolding mechanisms.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Google_DeepMind_Logo_2015.png/800px-Google_DeepMind_Logo_2015.png",
            "searchUrl": "https://en.wikipedia.org/wiki/AlphaFold"
          },
          {
            "date": "2023",
            "title": "Neuralink Human Trials Approved",
            "description": "Elon Musk's company received FDA approval to test its brain-computer interface implant in humans. The coin-sized device records from 1,024 electrodes via 64 threads thinner than hair. Early goals include restoring vision/mobility, with future ambitions for cognitive enhancement. Ethical concerns include privacy, hacking risks, and animal testing controversies during development.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Neuralink_Logo.png/800px-Neuralink_Logo.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Neuralink"
          }
        ]
      }
    }
  },
  
    "music": {
    "title": "Music Evolution",
    "description": "Pivotal moments that shaped musical genres and culture",
    "subtopics": {
      "classical": {
        "title": "Classical Music",
        "description": "Developments in Western art music from Baroque to Modern eras",
        "events": [
          {
            "date": "1685",
            "title": "Birth of Johann Sebastian Bach",
            "description": "The German composer and organist created masterpieces like the Brandenburg Concertos and Well-Tempered Clavier. His complex counterpoint and harmonic innovations laid foundations for Western music. Though obscure in his lifetime, Mendelssohn's 1829 St. Matthew Passion revival sparked lasting fame. The Bach-Werke-Verzeichnis (BWV) catalogs his 1,126 surviving works.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Johann_Sebastian_Bach.jpg/800px-Johann_Sebastian_Bach.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Johann_Sebastian_Bach"
          },
          {
            "date": "1788",
            "title": "Mozart Completes 'Jupiter' Symphony",
            "description": "Symphony No. 41 in C Major (K. 551) represents Mozart's symphonic peak with its five-theme finale fugato. Composed alongside Symphonies 39-40 in six weeks, its nickname came later from impresario Johann Salomon. The work's contrapuntal mastery and emotional range influenced Beethoven and Haydn. Mozart died three years later at 35, leaving his Requiem unfinished.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Wolfgang-amadeus-mozart_1.jpg/800px-Wolfgang-amadeus-mozart_1.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Symphony_No._41_(Mozart)"
          },
          {
            "date": "1824",
            "title": "Beethoven's 9th Symphony Premiere",
            "description": "The deaf composer's choral symphony premiered in Vienna with its revolutionary Ode to Joy finale. The first symphony to include vocal soloists and chorus, it expanded orchestral possibilities. Beethoven had to be turned to see the audience's standing ovation he couldn't hear. The work's universalist message led UNESCO to designate its manuscript a Memory of the World artifact.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Beethoven.jpg/800px-Beethoven.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Symphony_No._9_(Beethoven)"
          },
          {
            "date": "1876",
            "title": "Wagner's Ring Cycle Debut",
            "description": "The 15-hour Der Ring des Nibelungen opera cycle premiered at Bayreuth Festival House, designed for its performance. Wagner's Gesamtkunstwerk (total artwork) concept fused music, poetry, and stagecraft. The leitmotif technique influenced film scoring. Anti-Semitic elements in Wagner's writings later made his work controversial despite musical innovations.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Richard_Wagner_ca._1860s.jpg/800px-Richard_Wagner_ca._1860s.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Der_Ring_des_Nibelungen"
          },
          {
            "date": "1913",
            "title": "Stravinsky's Rite of Spring Riot",
            "description": "The Paris premiere of this ballet caused audience uproar over its dissonance and primal rhythms. Vaslav Nijinsky's choreography of pagan sacrifice added to the scandal. The complex time signatures (like 11/4) and polytonality redefined 20th-century music. Today it's considered a masterpiece of modernism, frequently performed and recorded.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Igor_Stravinsky_LOC_32392u.jpg/800px-Igor_Stravinsky_LOC_32392u.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Rite_of_Spring"
          },
          {
            "date": "1945",
            "title": "Britten's Peter Grimes Premiere",
            "description": "This English opera about an ostracized fisherman marked postwar classical music's resurgence. The Sea Interludes became orchestral staples. Britten's tonal yet modern style appealed broadly while incorporating serial techniques. The work established the Aldeburgh Festival and helped revive British opera after centuries of Italian/German dominance.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Benjamin_Britten_1968.jpg/800px-Benjamin_Britten_1968.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Peter_Grimes"
          },
          {
            "date": "1976",
            "title": "Glass's Einstein on the Beach",
            "description": "Philip Glass and Robert Wilson's 5-hour minimalist opera broke conventions with no plot and repetitive structures. The synthesizer/violin/voice score exemplified Glass's additive process. Performers could leave and return during the performance. This radical work brought minimalism to mainstream attention, influencing generations of composers.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Philip_Glass_2012.jpg/800px-Philip_Glass_2012.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Einstein_on_the_Beach"
          },
          {
            "date": "2008",
            "title": "Whitacre's Virtual Choir",
            "description": "Eric Whitacre pioneered internet choir collaborations with his Lux Aurumque project. 185 singers from 12 countries submitted YouTube videos blended into one performance. This democratized classical music participation globally. Subsequent Virtual Choirs grew to 8,000+ voices, demonstrating technology's potential to expand musical communities beyond physical limits.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Eric_Whitacre_in_2016.jpg/800px-Eric_Whitacre_in_2016.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Virtual_Choir"
          }
        ]
      },
      "jazz": {
        "title": "Jazz",
        "description": "Innovations in America's classical music from ragtime to fusion",
        "events": [
          {
            "date": "1917",
            "title": "Original Dixieland Jass Band Recording",
            "description": "This white New Orleans group made the first commercial jazz recording with 'Livery Stable Blues.' While African American musicians had developed jazz earlier, the ODJB's Victor Records release introduced the genre nationally. Their novelty style (with instruments imitating animal sounds) sparked both popularity and debates about cultural appropriation in jazz's commercialization.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Original_Dixieland_Jazz_Band_1919.jpg/800px-Original_Dixieland_Jazz_Band_1919.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Original_Dixieland_Jass_Band"
          },
          {
            "date": "1924",
            "title": "Louis Armstrong Joins Fletcher Henderson",
            "description": "Armstrong's move from Chicago to New York revolutionized jazz phrasing and improvisation. His Hot Five recordings (1925-28) like 'West End Blues' established solo improvisation as jazz's core. The gravelly-voiced trumpeter later became America's first Black entertainment superstar, influencing Crosby, Fitzgerald, and every jazz musician who followed.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Louis_Armstrong_restored.jpg/800px-Louis_Armstrong_restored.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Louis_Armstrong"
          },
          {
            "date": "1938",
            "title": "Benny Goodman's Carnegie Hall Concert",
            "description": "The 'King of Swing' legitimized jazz as art music by performing at America's most prestigious venue. The integrated quartet with Teddy Wilson (piano) and Lionel Hampton (vibes) broke racial barriers. The live recording of 'Sing Sing Sing' became definitive. This concert marked jazz's transition from dance halls to concert stages.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Benny_Goodman_and_his_orchestra_1943.jpg/800px-Benny_Goodman_and_his_orchestra_1943.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Benny_Goodman"
          },
          {
            "date": "1959",
            "title": "Miles Davis Releases Kind of Blue",
            "description": "This modal jazz masterpiece featuring John Coltrane and Bill Evans became history's best-selling jazz album. Tracks like 'So What' abandoned chord progressions for scales, creating spacious improvisation. Recorded in just two sessions with minimal rehearsals, its influence extends to rock and classical musicians. The album sells 5,000+ copies weekly six decades later.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Miles_Davis_Kind_of_Blue.jpg/800px-Miles_Davis_Kind_of_Blue.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Kind_of_Blue"
          },
          {
            "date": "1964",
            "title": "A Love Supreme Recording",
            "description": "John Coltrane's spiritual jazz suite blended modal improvisation with devotional intensity. The four-part work reflected his post-addiction spiritual awakening. The iconic saxophone riff on 'Acknowledgement' became jazz's most recognizable motif. The album's universalist spirituality influenced genres from rock to gospel, selling over 500,000 copies by 1970.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/John_Coltrane_1963.jpg/800px-John_Coltrane_1963.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/A_Love_Supreme"
          },
          {
            "date": "1976",
            "title": "Weather Report's Heavy Weather",
            "description": "Joe Zawinul and Wayne Shorter's jazz fusion band peaked with this platinum-selling album. 'Birdland' became a standard covered by Manhattan Transfer and Quincy Jones. The synthesizer/saxophone interplay and Jaco Pastorius' fretless bass redefined jazz instrumentation. This album brought jazz-rock fusion to mainstream audiences.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Weather_Report_-_Heavy_Weather.jpg/800px-Weather_Report_-_Heavy_Weather.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Heavy_Weather_(Weather_Report_album)"
          },
          {
            "date": "1992",
            "title": "Wynton Marsalis Wins Classical/Jazz Grammys",
            "description": "The trumpeter became the only artist to win Grammy Awards in both jazz and classical categories the same year. His technical mastery and advocacy helped jazz regain cultural prestige. As Jazz at Lincoln Center's director, he canonized jazz repertoire while controversially dismissing fusion and avant-garde styles.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wynton_Marsalis.jpg/800px-Wynton_Marsalis.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Wynton_Marsalis"
          },
          {
            "date": "2016",
            "title": "Kamasi Washington's The Epic",
            "description": "This 3-hour jazz opus revived mainstream interest in acoustic jazz with its spiritual Afrofuturism. Blending Coltrane-esque sax with hip-hop and R&B influences, Washington attracted young audiences. The 10-piece band's orchestral textures and choir collaborations expanded jazz's sonic possibilities for the streaming era.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Kamasi_Washington_2017.jpg/800px-Kamasi_Washington_2017.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Kamasi_Washington"
          }
        ]
      },
      "rock": {
        "title": "Rock & Pop",
        "description": "Evolution of popular music from 1950s to present",
        "events": [
          {
            "date": "1954",
            "title": "Elvis Records 'That's All Right'",
            "description": "At Sun Studio, Elvis Presley's spontaneous blues cover launched rockabilly and his career. Producer Sam Phillips sought 'a white man with the Negro sound.' The recording's slapped bass and Scotty Moore's guitar licks became rock 'n' roll templates. Local DJ Dewey Phillips played it repeatedly, making Elvis a Memphis sensation overnight.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Elvis_Presley_promoting_Jailhouse_Rock.jpg/800px-Elvis_Presley_promoting_Jailhouse_Rock.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/That%27s_All_Right"
          },
          {
            "date": "1964",
            "title": "Beatles Appear on Ed Sullivan Show",
            "description": "The Fab Four's U.S. debut drew 73 million viewers (34% of Americans), launching the British Invasion. Their five-song set caused nationwide teenage hysteria. Sullivan had booked them after seeing Beatlemania at Heathrow Airport. This appearance shifted pop culture permanently toward youth-oriented music and fashion.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/The_Beatles_on_Ed_Sullivan.jpg/800px-The_Beatles_on_Ed_Sullivan.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Beatles%27_first_U.S._visit"
          },
          {
            "date": "1967",
            "title": "Sgt. Pepper's Lonely Hearts Club Band",
            "description": "The Beatles' studio masterpiece pioneered concept albums and psychedelic rock. George Martin's production incorporated orchestral crescendos, tape loops, and Indian instruments. The iconic cover collage featured 70+ cultural figures. It spent 27 weeks at #1 and won 4 Grammys, elevating rock from singles to artistic statements.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Sgt._Pepper%27s_Lonely_Hearts_Club_Band.jpg/800px-Sgt._Pepper%27s_Lonely_Hearts_Club_Band.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Sgt._Pepper%27s_Lonely_Hearts_Club_Band"
          },
          {
            "date": "1975",
            "title": "Born to Run Released",
            "description": "Bruce Springsteen's third album blended poetic lyrics with Wall of Sound production. The title track's desperate romanticism became an anthem. Simultaneous Time/Newsweek covers declared him 'rock's future.' Though not an immediate commercial hit, it established Springsteen's everyman persona and E Street Band's signature style.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Bruce_Springsteen_-_Born_to_Run.jpg/800px-Bruce_Springsteen_-_Born_to_Run.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Born_to_Run"
          },
          {
            "date": "1982",
            "title": "Thriller Released",
            "description": "Michael Jackson's album became history's best-selling with 70+ million copies. The John Landis-directed 'Thriller' video revolutionized music videos as short films. Seven singles reached Top 10, blending pop, rock, and funk. Quincy Jones' production set new standards for recording quality. The album won 8 Grammys and dominated 1983-84 globally.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Michael_Jackson_-_Thriller.png/800px-Michael_Jackson_-_Thriller.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Thriller_(album)"
          },
          {
            "date": "1991",
            "title": "Nevermind Tops Charts",
            "description": "Nirvana's second album displaced Michael Jackson at #1, signaling grunge's mainstream breakthrough. 'Smells Like Teen Spirit' became Generation X's anthem with its loud-quiet dynamics. Butch Vig's raw yet polished production balanced punk energy with pop hooks. The album's success pressured major labels to sign alternative rock acts.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/NirvanaNevermindalbumcover.jpg/800px-NirvanaNevermindalbumcover.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Nevermind"
          },
          {
            "date": "2001",
            "title": "iPod Launched",
            "description": "Apple's '1,000 songs in your pocket' device revolutionized music consumption. The scroll wheel and 5GB hard drive made digital libraries portable. Combined with iTunes (2003), it ended the CD era. Over 450 million iPods sold by 2022. The ecosystem paved way for streaming, though Apple discontinued the iPod line in 2022 as phones absorbed its functions.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/IPod_1st_Gen_white.png/800px-IPod_1st_Gen_white.png",
            "searchUrl": "https://en.wikipedia.org/wiki/IPod"
          },
          {
            "date": "2020",
            "title": "Blinding Lights Breaks Billboard Record",
            "description": "The Weeknd's synthwave hit spent 90+ weeks on Hot 100, surpassing previous longevity records. Its 1980s-inspired production contrasted with contemporary trap trends. TikTok challenges and pandemic-era streaming boosted its staying power. The song exemplified pop's cyclical nostalgia while setting new commercial benchmarks.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/The_Weeknd_-_Blinding_Lights.png/800px-The_Weeknd_-_Blinding_Lights.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Blinding_Lights"
          }
        ]
      },
      "electronic": {
        "title": "Electronic Music",
        "description": "From early experiments to EDM festivals",
        "events": [
          {
            "date": "1955",
            "title": "Stockhausen's Elektronische Musik",
            "description": "The German composer's Studie II was the first published electronic composition using pure sine waves. Created at Cologne's NWDR studio, it realized Schoenberg's serialism principles electronically. Stockhausen later pioneered spatial music with 4-channel tape works. These experiments laid foundations for synthesizers and electronic production techniques.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Karlheinz_Stockhausen_2005.jpg/800px-Karlheinz_Stockhausen_2005.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Karlheinz_Stockhausen"
          },
          {
            "date": "1968",
            "title": "Moog Modular Demonstrated",
            "description": "Robert Moog's voltage-controlled synthesizer debuted at Monterey Pop Festival. Wendy Carlos' Switched-On Bach (1968) proved its classical potential, winning 3 Grammys. The Minimoog (1970) brought synths to touring musicians. Moog's inventions enabled new timbres in rock (Emerson, Lake & Palmer), disco (Giorgio Moroder), and hip-hop (Afrika Bambaataa).",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Moog_Modular_55_img2.jpg/800px-Moog_Modular_55_img2.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Moog_synthesizer"
          },
          {
            "date": "1977",
            "title": "Donna Summer's 'I Feel Love'",
            "description": "Giorgio Moroder's production pioneered electronic disco with its entirely synthesized backing track. The pulsing sequencer pattern influenced techno and house music's development. Brian Eno called it 'the sound of the future' upon hearing it in Berlin. The track's minimal vocals and hypnotic groove made it an underground club staple.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Donna_Summer_I_Feel_Love.jpg/800px-Donna_Summer_I_Feel_Love.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/I_Feel_Love"
          },
          {
            "date": "1981",
            "title": "Roland TB-303 Released",
            "description": "This bass synthesizer failed commercially but became acid house's signature sound when repurposed in late 1980s Chicago. Its squelchy, resonant tones defined Phuture's 'Acid Tracks' (1987). Cheap secondhand units fueled UK rave culture. The 303's unexpected sonic character made it electronic music's most iconic instrument.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Roland_TB-303.jpg/800px-Roland_TB-303.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Roland_TB-303"
          },
          {
            "date": "1988",
            "title": "Second Summer of Love",
            "description": "UK acid house parties exploded after DJs brought Chicago records to Ibiza then England. Ecstasy use and smiley-face iconography defined the rave culture. Events like Shoom and Spectrum drew thousands illegally to warehouses. The scene birthed British dance music genres from jungle to drum 'n' bass.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Smiley.svg/800px-Smiley.svg.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Second_Summer_of_Love"
          },
          {
            "date": "1999",
            "title": "Daft Punk's 'One More Time'",
            "description": "The French duo's auto-tuned house anthem brought electronic dance music to global pop charts. Discovery (2001) fused samples with original production in a concept album format. Their robot personas and pyramid stage shows set new standards for electronic live performance. The track preseded EDM's 2010s stadium-filling dominance.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Daft_Punk_One_More_Time.png/800px-Daft_Punk_One_More_Time.png",
            "searchUrl": "https://en.wikipedia.org/wiki/One_More_Time_(Daft_Punk_song)"
          },
          {
            "date": "2011",
            "title": "Skrillex's Scary Monsters EP",
            "description": "This dubstep release popularized aggressive 'brostep' sounds in America. The EP's distorted bass wobbles and video game samples appealed to metal/punk fans. Skrillex (Sonny Moore) won 3 Grammys, surprising the industry. His OWSLA label became an EDM powerhouse, bridging underground and mainstream electronic scenes.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Skrillex_-_Scary_Monsters_and_Nice_Sprites.png/800px-Skrillex_-_Scary_Monsters_and_Nice_Sprites.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Scary_Monsters_and_Nice_Sprites"
          },
          {
            "date": "2019",
            "title": "Billie Eilish's 'When We All Fall Asleep'",
            "description": "Produced by brother Finneas in their bedroom, this album blended electronic, pop, and trap with whispered vocals. The sparse production emphasized sub-bass frequencies tailored for streaming and headphones. At 17, Eilish became the youngest artist to sweep major Grammy categories, signaling DIY electronic production's mainstream acceptance.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Billie_Eilish_-_When_We_All_Fall_Asleep%2C_Where_Do_We_Go%3F.png/800px-Billie_Eilish_-_When_We_All_Fall_Asleep%2C_Where_Do_We_Go%3F.png",
            "searchUrl": "https://en.wikipedia.org/wiki/When_We_All_Fall_Asleep,_Where_Do_We_Go%3F"
          }
        ]
      },
      "hiphop": {
        "title": "Hip-Hop",
        "description": "From Bronx block parties to global dominance",
        "events": [
          {
            "date": "1973",
            "title": "DJ Kool Herc's Back-to-School Party",
            "description": "In the Bronx's Sedgwick Avenue rec room, Clive Campbell extended breakbeats using two turntables, birthing hip-hop's DJ foundation. His 'merry-go-round' technique isolated percussion breaks from funk records. This 1520 Sedgwick Avenue event is considered hip-hop's founding moment, though similar techniques emerged independently elsewhere.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/DJ_Kool_Herc_2005.jpg/800px-DJ_Kool_Herc_2005.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/DJ_Kool_Herc"
          },
          {
            "date": "1979",
            "title": "'Rapper's Delight' Charts",
            "description": "The Sugarhill Gang's 15-minute single brought rap to mainstream audiences, reaching #36 on Billboard. Using Chic's 'Good Times' bassline without clearance, it sparked sampling debates. Though not the first rap record, its commercial success proved hip-hop's marketability. The track sold over 2 million copies in the US alone.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Sugarhill_Gang_Rappers_Delight.jpg/800px-Sugarhill_Gang_Rappers_Delight.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Rapper%27s_Delight"
          },
          {
            "date": "1988",
            "title": "Public Enemy's It Takes a Nation",
            "description": "This politically charged album combined Bomb Squad's dense production with Chuck D's revolutionary lyrics. Tracks like 'Fight the Power' addressed systemic racism while sampling James Brown and Sly Stone. The album's sonic collage approach set new standards for sampling complexity and hip-hop's intellectual potential.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Public_Enemy_It_Takes_a_Nation.jpg/800px-Public_Enemy_It_Takes_a_Nation.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/It_Takes_a_Nation_of_Millions_to_Hold_Us_Back"
          },
          {
            "date": "1992",
            "title": "Dr. Dre's The Chronic",
            "description": "This G-funk masterpiece established West Coast hip-hop's dominance with its Parliament-sampling grooves. Snoop Dogg's smooth flow complemented Dre's layered production. The album sold 5.7 million copies despite parental advisory warnings. Its success launched Death Row Records and 1990s gangsta rap's commercial peak.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Dr._Dre_-_The_Chronic.png/800px-Dr._Dre_-_The_Chronic.png",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Chronic"
          },
          {
            "date": "1996",
            "title": "Tupac & Biggie Murders",
            "description": "The fatal shootings of rap's biggest stars (Tupac in September, Biggie in March 1997) escalated East-West Coast tensions. Both cases remain officially unsolved, fueling conspiracy theories. Their posthumous album sales exceeded living careers, demonstrating hip-hop's growing cultural permanence.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Tupac_Shakur2.jpg/800px-Tupac_Shakur2.jpg",
            "searchUrl": "https://en.wikipedia.org/wiki/Tupac_Shakur"
          },
          {
            "date": "2000",
            "title": "Eminem's Marshall Mathers LP",
            "description": "The white rapper's controversial album sold 1.76 million copies in its first week, a record for solo artists. Tracks like 'Stan' demonstrated complex storytelling over Dr. Dre's production. The album's violent fantasies and homophobic slurs sparked protests but cemented Eminem as a generational voice.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Eminem_-_The_Marshall_Mathers_LP.png/800px-Eminem_-_The_Marshall_Mathers_LP.png",
            "searchUrl": "https://en.wikipedia.org/wiki/The_Marshall_Mathers_LP"
          },
          {
            "date": "2016",
            "title": "Kendrick Lamar's Pulitzer Win",
            "description": "DAMN. became the first non-classical/jazz work to win the Pulitzer Prize for Music. The committee praised its 'virtuosic song collection' capturing African American life. This institutional recognition validated hip-hop as art music. Lamar's subsequent Black Panther soundtrack (2018) further blurred genre boundaries.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Kendrick_Lamar_-_Damn.png/800px-Kendrick_Lamar_-_Damn.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Damn_(Kendrick_Lamar_album)"
          },
          {
            "date": "2020",
            "title": "Travis Scott's Fortnite Concert",
            "description": "The virtual Astronomical event drew 27.7 million unique players, redefining music promotion. The interactive experience featured a giant Scott avatar and psychedelic visuals. Epic Games later reported 45.8 million total views across replays. This demonstrated metaverse concerts' potential amid pandemic lockdowns.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Travis_Scott_Fornite_Concert.png/800px-Travis_Scott_Fornite_Concert.png",
            "searchUrl": "https://en.wikipedia.org/wiki/Travis_Scott"
          }
        ]
      }
    }
  }
}